kholia/hal_wch/ch32fun/ch32h41xhw.h
typedef union {
	uint32_t __FULL;
	struct {
		uint32_t BR0 :1;
		uint32_t BR1 :1;
		uint32_t BR2 :1;
		uint32_t BR3 :1;
		uint32_t BR4 :1;
		uint32_t BR5 :1;
		uint32_t BR6 :1;
		uint32_t BR7 :1;
		uint32_t BR8 :1;
		uint32_t BR9 :1;
		uint32_t BR10 :1;
		uint32_t BR11 :1;
		uint32_t BR12 :1;
		uint32_t BR13 :1;
		uint32_t BR14 :1;
		uint32_t BR15 :1;
		uint32_t :16;
	};
} GPIO_BCR_t;
typedef union {
	uint32_t __FULL;
	struct {
		uint32_t LCK0 :1;
		uint32_t LCK1 :1;
		uint32_t LCK2 :1;
		uint32_t LCK3 :1;
		uint32_t LCK4 :1;
		uint32_t LCK5 :1;
		uint32_t LCK6 :1;
		uint32_t LCK7 :1;
		uint32_t LCK8 :1;
		uint32_t LCK9 :1;
		uint32_t LCK10 :1;
		uint32_t LCK11 :1;
		uint32_t LCK12 :1;
		uint32_t LCK13 :1;
		uint32_t LCK14 :1;
		uint32_t LCK15 :1;
		uint32_t LCKK :1;
		uint32_t :15;
	};
} GPIO_LCKR_t;
typedef union {
	uint32_t __FULL;
	struct {
		uint32_t SPEED0 :1;
		uint32_t SPEED1 :1;
		uint32_t SPEED2 :1;
		uint32_t SPEED3 :1;
		uint32_t SPEED4 :1;
		uint32_t SPEED5 :1;
		uint32_t SPEED6 :1;
		uint32_t SPEED7 :1;
		uint32_t SPEED8 :1;
		uint32_t SPEED9 :1;
		uint32_t SPEED10 :1;
		uint32_t SPEED11 :1;
		uint32_t SPEED12 :1;
		uint32_t SPEED13 :1;
		uint32_t SPEED14 :1;
		uint32_t SPEED15 :1;
		uint32_t SPEED16 :1;
		uint32_t SPEED17 :1;
		uint32_t SPEED18 :1;
		uint32_t SPEED19 :1;
		uint32_t SPEED20 :1;
		uint32_t SPEED21 :1;
		uint32_t SPEED22 :1;
		uint32_t SPEED23 :1;
		uint32_t SPEED24 :1;
		uint32_t SPEED25 :1;
		uint32_t SPEED26 :1;
		uint32_t SPEED27 :1;
		uint32_t SPEED28 :1;
		uint32_t SPEED29 :1;
		uint32_t SPEED30 :1;
		uint32_t SPEED31 :1;
	};
} GPIO_SPEED_t;
typedef struct
{
	__IO uint32_t CFGLR;
	__IO uint32_t CFGHR;
	__I  uint32_t INDR;
	__IO uint32_t OUTDR;
	__IO uint32_t BSHR;
	__IO uint32_t BCR;
	__IO uint32_t LCKR;
	__IO uint32_t SPEED;
} GPIO_TypeDef;

#define DYN_GPIO_READ(gpio, field) ((GPIO_##field##_t) { .__FULL = gpio->field })
#define DYN_GPIO_WRITE(gpio, field, ...) gpio->field = ((const GPIO_##field##_t) __VA_ARGS__).__FULL
#define DYN_GPIO_MOD(gpio, field, reg, val) {GPIO_##field##_t tmp; tmp.__FULL = gpio->field; tmp.reg = val; gpio->field = tmp.__FULL;}

/* Alternate Function I/O */
typedef struct
{
	__IO uint32_t PCFR1;
	__IO uint32_t GPIOA_AFLR;
	__IO uint32_t GPIOA_AFHR;
	__IO uint32_t GPIOB_AFLR;
	__IO uint32_t GPIOB_AFHR;
	__IO uint32_t GPIOC_AFLR;
	__IO uint32_t GPIOC_AFHR;
	__IO uint32_t GPIOD_AFLR;
	__IO uint32_t GPIOD_AFHR;
	__IO uint32_t GPIOE_AFLR;
	__IO uint32_t GPIOE_AFHR;
	__IO uint32_t GPIOF_AFLR;
	__IO uint32_t GPIOF_AFHR;
	uint32_t      RESERVED0[2];
	__IO uint32_t EXTICR1;
	__IO uint32_t EXTICR2;
} AFIO_TypeDef;

/* Inter Integrated Circuit Interface */
typedef struct
{
		__IO uint16_t CTLR1;
		uint16_t      RESERVED0;
		__IO uint16_t CTLR2;
		uint16_t      RESERVED1;
		__IO uint16_t OADDR1;
		uint16_t      RESERVED2;
		__IO uint16_t OADDR2;
		uint16_t      RESERVED3;
		__IO uint16_t DATAR;
		uint16_t      RESERVED4;
		__IO uint16_t STAR1;
		uint16_t      RESERVED5;
		__IO uint16_t STAR2;
		uint16_t      RESERVED6;
		__IO uint16_t CKCFGR;
		uint16_t      RESERVED7;
	__IO uint16_t RTR;
	uint16_t      RESERVED8;
} I2C_TypeDef;

/* Inter Integrated 3 Circuit Interface */
typedef struct
{
	__IO uint32_t CTLR;
	__IO uint32_t CFGR;
	uint32_t RESERVED0[2];
	__IO uint32_t RDBR;
	__IO uint32_t RDWR;
	__IO uint32_t TDBR;
	__IO uint32_t TDWR;
	__IO uint32_t IBIDR;
	__IO uint32_t TGTTDR;
	uint32_t RESERVED1;
	__IO uint32_t RESET;
	__IO uint32_t STATR;
	__IO uint32_t STATER;
	uint32_t RESERVED2[2];
	__IO uint32_t RMR;
	uint32_t RESERVED3[3];
	__IO uint32_t EVR;
	__IO uint32_t INTENR;
	__IO uint32_t CEVR;
	uint32_t RESERVED4;
	__IO uint32_t DEVR0;
	__IO uint32_t DEVR1;
	__IO uint32_t DEVR2;
	__IO uint32_t DEVR3;
	__IO uint32_t DEVR4;
	uint32_t RESERVED5[7];
	__IO uint32_t MAXRLR;
	__IO uint32_t MAXWLR;
	uint32_t RESERVED6[2];
	__IO uint32_t TIMINGR0;
	__IO uint32_t TIMINGR1;
	__IO uint32_t TIMINGR2;
	uint32_t RESERVED7[5];
	__IO uint32_t BCR;
	__IO uint32_t DCR;
	__IO uint32_t GETCAPR;
	__IO uint32_t CRCAPR;
	__IO uint32_t GETMDSR;
	__IO uint32_t EPIDR;
} I3C_TypeDef;

/* Independent WatchDog */
typedef struct
{
		__IO uint32_t CTLR;
		__IO uint32_t PSCR;
		__IO uint32_t RLDR;
		__IO uint32_t STATR;
} IWDG_TypeDef;

/* Power Control */
typedef struct
{
		__IO uint32_t CTLR;
		__IO uint32_t CSR;
} PWR_TypeDef;

/* Reset and Clock Control */
typedef struct
{
	__IO uint32_t CTLR;
	__IO uint32_t CFGR0;
	__IO uint32_t PLLCFGR;
	__IO uint32_t INTR;
	__IO uint32_t HB2PRSTR;
	__IO uint32_t HB1PRSTR;
	__IO uint32_t HBPCENR;
	__IO uint32_t HB2PCENR;
	__IO uint32_t HB1PCENR;
	__IO uint32_t BDCTLR;
	__IO uint32_t RSTSCKR;
	__IO uint32_t HBRSTR;
	__IO uint32_t CFGR2;
	__IO uint32_t PLLCFGR2;
} RCC_TypeDef;

/* Real-Time Clock */
typedef struct
{
	__IO uint16_t CTLRH;
	uint16_t      RESERVED0;
	__IO uint16_t CTLRL;
	uint16_t      RESERVED1;
	__IO uint16_t PSCRH;
	uint16_t      RESERVED2;
	__IO uint16_t PSCRL;
	uint16_t      RESERVED3;
	__IO uint16_t DIVH;
	uint16_t      RESERVED4;
	__IO uint16_t DIVL;
	uint16_t      RESERVED5;
	__IO uint16_t CNTH;
	uint16_t      RESERVED6;
	__IO uint16_t CNTL;
	uint16_t      RESERVED7;
	__IO uint16_t ALRMH;
	uint16_t      RESERVED8;
	__IO uint16_t ALRML;
	uint16_t      RESERVED9;
} RTC_TypeDef;

/* SDIO Registers */
typedef struct
{
	__IO uint32_t POWER;
	__IO uint32_t CLKCR;
	__IO uint32_t ARG;
	__IO uint32_t CMD;
	__I uint32_t RESPCMD;
	__I uint32_t RESP1;
	__I uint32_t RESP2;
	__I uint32_t RESP3;
	__I uint32_t RESP4;
	__IO uint32_t DTIMER;
	__IO uint32_t DLEN;
	__IO uint32_t DCTRL;
	__I uint32_t DCOUNT;
	__I uint32_t STA;
	__IO uint32_t ICR;
	__IO uint32_t MASK;
	uint32_t RESERVED0[2];
	__I uint32_t FIFOCNT;
	uint32_t RESERVED1[5];
	__IO uint32_t DCTRL2;
	uint32_t RESERVED2[7];
	__IO uint32_t FIFO;
} SDIO_TypeDef;

/* Serial Peripheral Interface */
typedef struct
{
	__IO uint16_t CTLR1;
	uint16_t      RESERVED0;
	__IO uint16_t CTLR2;
	uint16_t      RESERVED1;
	__IO uint16_t STATR;
	uint16_t      RESERVED2;
	__IO uint16_t DATAR;
	uint16_t      RESERVED3;
	__IO uint16_t CRCR;
	uint16_t      RESERVED4;
	__IO uint16_t RCRCR;
	uint16_t      RESERVED5;
	__IO uint16_t TCRCR;
	uint16_t      RESERVED6;
	__IO uint16_t I2SCFGR;
	uint16_t      RESERVED7;
	__IO uint16_t I2SPR;
	uint16_t      RESERVED8;
	__IO uint16_t HSCR;
	uint16_t      RESERVED9;
} SPI_TypeDef;

/* TIM */
typedef struct
{
	__IO uint16_t CTLR1;
	uint16_t RESERVED0;
	__IO uint16_t CTLR2;
	uint16_t RESERVED1;
	__IO uint16_t SMCFGR;
	uint16_t RESERVED2;
	__IO uint16_t DMAINTENR;
	uint16_t RESERVED3;
	__IO uint16_t INTFR;
	uint16_t RESERVED4;
	__IO uint16_t SWEVGR;
	uint16_t RESERVED5;
	__IO uint16_t CHCTLR1;
	uint16_t RESERVED6;
	__IO uint16_t CHCTLR2;
	uint16_t RESERVED7;
	__IO uint16_t CCER;
	uint16_t RESERVED8;
	union
	{
		__IO uint32_t CNT_32;  //TIM9,10,11,12
		struct
		{
				__IO uint16_t CNT;
				uint16_t RESERVED9;
		};
	};
	__IO uint16_t PSC;
	uint16_t RESERVED10;
	union
	{
		__IO uint32_t ATRLR_32;//TIM9,10,11,12
		struct
		{
				__IO uint16_t ATRLR;
				uint16_t RESERVED11;
		};
	};
	__IO uint16_t RPTCR;
	uint16_t RESERVED12;
	union
	{
		__IO uint32_t CH1CVR_32;
		struct
		{
				__IO uint16_t CH1CVR;
				uint16_t RESERVED13;
		};
	};
		union
	{
		__IO uint32_t CH2CVR_32;
		struct
		{
				__IO uint16_t CH2CVR;
				uint16_t RESERVED14;
		};
	};
	union
	{
		__IO uint32_t CH3CVR_32;
		struct
		{
				__IO uint16_t CH3CVR;
				uint16_t RESERVED15;
		};
	};
	union
	{
		__IO uint32_t CH4CVR_32;
		struct
		{
				__IO uint16_t CH4CVR;
				uint16_t RESERVED16;
		};
	};
	__IO uint16_t BDTR;
	uint16_t RESERVED17;
	__IO uint16_t DMACFGR;
	uint16_t RESERVED18;
	__IO uint16_t DMAADR;
	uint16_t RESERVED19;
	__IO uint16_t AUX;
	uint16_t RESERVED20;
} TIM_TypeDef;

/* Universal Synchronous Asynchronous Receiver Transmitter */
typedef struct
{
	__IO uint16_t STATR;
	uint16_t RESERVED0;
	__IO uint16_t DATAR;
	uint16_t RESERVED1;
	__IO uint16_t BRR;
	uint16_t RESERVED2;
	__IO uint16_t CTLR1;
	uint16_t RESERVED3;
	__IO uint16_t CTLR2;
	uint16_t RESERVED4;
	__IO uint16_t CTLR3;
	uint16_t RESERVED5;
	__IO uint16_t GPR;
	uint16_t RESERVED6;
	__IO uint16_t CTLR4;
	uint16_t RESERVED7;
} USART_TypeDef;

/* Window WatchDog */
typedef struct
{
		__IO uint32_t CTLR;
		__IO uint32_t CFGR;
		__IO uint32_t STATR;
} WWDG_TypeDef;

/* OPA Registers */
typedef struct
{
	__IO uint32_t CTLR1;
	__IO uint32_t CTLR2;
	__IO uint32_t CTLR3;
	__IO uint32_t CMP_CTLR;
	__IO uint32_t CMP_STATR;
} OPA_TypeDef;

/* RNG Registers */
typedef struct
{
	__IO uint32_t CR;
	__IO uint32_t SR;
	__IO uint32_t DR;
} RNG_TypeDef;

