kholia/hal_wch/ch32fun/ch32h41xhw.h
/* LPTIM Registers */
typedef struct
{
	__IO uint32_t ISR;
	__IO uint32_t ICR;
	__IO uint32_t IER;
	__IO uint32_t CFGR;
	__IO uint32_t CR;
	__IO uint16_t CMP;
	uint16_t Reserved0;
	__IO uint16_t ARR;
	uint16_t Reserved1;
	__IO uint16_t CNT;
	uint16_t Reserved2;
} LPTIM_TypeDef;

/* DVP Registers */
typedef struct
{
	__IO uint8_t CR0;
	__IO uint8_t CR1;
	__IO uint8_t IER;
	__IO uint8_t Reserved0;
	__IO uint16_t ROW_NUM;
	__IO uint16_t COL_NUM;
	__IO uint32_t DMA_BUF0;
	__IO uint32_t DMA_BUF1;
	__IO uint8_t IFR;
	__IO uint8_t STATUS;
	__IO uint16_t Reserved1;
	__IO uint16_t ROW_CNT;
	__IO uint16_t Reserved2;
	__IO uint16_t HOFFCNT;
	__IO uint16_t VST;
	__IO uint16_t CAPCNT;
	__IO uint16_t VLINE;
	__IO uint32_t DR;
} DVP_TypeDef;

/* PD Registers */
typedef struct
{
	union
	{
		__IO uint32_t USBPD_CONFIG;
		struct
		{
			__IO uint16_t CONFIG;
			__IO uint16_t BMC_CLK_CNT;
		};
	};
	union
	{
		__IO uint32_t USBPD_CONTROL;
		struct
		{
			union
			{
				__IO uint16_t R16_CONTROL;
				struct
				{
					__IO uint8_t  CONTROL;
					__IO uint8_t  TX_SEL;
				};
			};
			__IO uint16_t BMC_TX_SZ;
		};
	};
	union
	{
		__IO uint32_t USBPD_STATUS;
		struct
		{
			union
			{
				__IO uint16_t R16_STATUS;
				struct
				{
					__IO uint8_t  DATA_BUF;
					__IO uint8_t  STATUS;
				};
			};
			__IO uint16_t BMC_BYTE_CNT;
		};
	};
	union
	{
		__IO uint32_t USBPD_PORT;
		struct
		{
			__IO uint16_t PORT_CC1;
			__IO uint16_t PORT_CC2;
		};
	};
	__IO uint32_t USBPD_DMA;
} USBPD_TypeDef;

/* USBSS Deveice Registers */
typedef struct
{
	__IO uint8_t  UEP_TX_CFG;             // 0x0
	__IO uint8_t  UEP_TX_CR;              // 0x1
	__IO uint8_t  UEP_TX_SEQ;             // 0x2
	__IO uint8_t  UEP_TX_ST;              // 0x3
	__IO uint8_t  UEP_TX_CHAIN_CR;        // 0x4
	__IO uint8_t  UEP_TX_CHAIN_ST;        // 0x5
	__IO uint16_t UEP_TX_CHAIN_LEN;       // 0x6
	__IO uint8_t  UEP_TX_CHAIN_EXP_NUMP;  // 0x8
	__IO uint8_t  UEP_TX_CHAIN_NUMP;      // 0x9
	__IO uint16_t UEP_TX_DMA_OFS;         // 0xA
	__IO uint32_t UEP_TX_DMA;             // 0xC
} USBSS_EP_TX_TypeDef;

typedef struct
{
	__IO uint8_t  UEP_RX_CFG;             // 0x0
	__IO uint8_t  UEP_RX_CR;              // 0x1
	__IO uint8_t  UEP_RX_SEQ;             // 0x2
	__IO uint8_t  UEP_RX_ST;              // 0x3
	__IO uint8_t  UEP_RX_CHAIN_CR;        // 0x4
	__IO uint8_t  UEP_RX_CHAIN_ST;        // 0x5
	__IO uint16_t UEP_RX_CHAIN_LEN;       // 0x6
	__IO uint8_t  UEP_RX_CHAIN_MAX_NUMP;  // 0x8
	__IO uint8_t  UEP_RX_CHAIN_NUMP;      // 0x9
	__IO uint16_t UEP_RX_DMA_OFS;         // 0xA
	__IO uint32_t UEP_RX_DMA;             // 0xC
} USBSS_EP_RX_TypeDef;

typedef struct
{
	__IO uint32_t LINK_CFG;
	__IO uint32_t LINK_CTRL;
	__IO uint32_t LINK_INT_CTRL;
	__IO uint32_t LINK_INT_FLAG;
	__IO uint32_t LINK_STATUS;
	uint8_t Reserved0[3];
	__IO uint8_t LINK_ITP_PRE;
	uint8_t Reserved1[5];
	__IO uint8_t LINK_U2_INACT_TIMER;
	uint8_t Reserved2[10];
	__IO uint8_t LINK_U1_WKUP_FILTER;
	uint8_t Reserved3[1];
	__IO uint16_t LINK_U1_WKUP_TMR;
	__IO uint8_t LINK_U2_WKUP_FILTER;
	uint8_t Reserved4[3];
	__IO uint8_t LINK_U3_WKUP_FILTER;
	uint8_t Reserved5[1];
	__IO uint16_t LINK_U3_WKUP_TMR;
	uint8_t Reserved6[12];
	__IO uint16_t LINK_ISO_DLY;
	uint8_t Reserved7[14];
	__IO uint16_t LINK_LPM_CR;
	uint8_t Reserved8[2];
	__IO uint32_t LINK_LMP_PORT_CAP;
	__IO uint32_t LINK_LMP_RX_DATA0;
	__IO uint32_t LINK_LMP_RX_DATA1;
	__IO uint32_t LINK_LMP_RX_DATA2;
	__IO uint32_t LINK_LMP_TX_DATA0;
	__IO uint32_t LINK_LMP_TX_DATA1;
	__IO uint32_t LINK_LMP_TX_DATA2;
	__IO uint32_t USB_CONTROL;
	__IO uint32_t USB_STATUS;
	__IO uint32_t USB_ITP;
	__IO uint32_t USB_ITP_ADJ;
	__IO uint16_t UEP_TX_EN;
	__IO uint16_t UEP_RX_EN;
	__IO uint32_t UEP0_TX_CTRL;
	__IO uint32_t UEP0_RX_CTRL;
	__IO uint32_t UEP0_TX_DMA;
	__IO uint32_t UEP0_RX_DMA;
	__IO uint32_t UEP0_TX_DMA_OFS;
	__IO uint32_t UEP0_RX_DMA_OFS;
	uint8_t Reserved9[36];
	__IO USBSS_EP_TX_TypeDef EP1_TX;
	__IO USBSS_EP_RX_TypeDef EP1_RX;
	__IO USBSS_EP_TX_TypeDef EP2_TX;
	__IO USBSS_EP_RX_TypeDef EP2_RX;
	__IO USBSS_EP_TX_TypeDef EP3_TX;
	__IO USBSS_EP_RX_TypeDef EP3_RX;
	__IO USBSS_EP_TX_TypeDef EP4_TX;
	__IO USBSS_EP_RX_TypeDef EP4_RX;
	__IO USBSS_EP_TX_TypeDef EP5_TX;
	__IO USBSS_EP_RX_TypeDef EP5_RX;
	__IO USBSS_EP_TX_TypeDef EP6_TX;
	__IO USBSS_EP_RX_TypeDef EP6_RX;
	__IO USBSS_EP_TX_TypeDef EP7_TX;
	__IO USBSS_EP_RX_TypeDef EP7_RX;
} USBSSD_TypeDef;

typedef struct
{
	__IO uint32_t LINK_CFG;
	__IO uint32_t LINK_CTRL;
	__IO uint32_t LINK_INT_CTRL;
	__IO uint32_t LINK_INT_FLAG;
	__IO uint32_t LINK_STATUS;
	uint8_t Reserved0[3];
	__IO uint8_t LINK_ITP_PRE;
	uint8_t Reserved1[5];
	__IO uint8_t LINK_U2_INACT_TIMER;
	uint8_t Reserved2[10];
	__IO uint8_t LINK_U1_WKUP_FILTER;
	uint8_t Reserved3[3];
	__IO uint8_t LINK_U2_WKUP_FILTER;
	uint8_t Reserved4[3];
	__IO uint8_t LINK_U3_WKUP_FILTER;
	uint8_t Reserved5[15];
	__IO uint16_t LINK_ISO_DLY;
	uint8_t Reserved6[14];
	__IO uint16_t LINK_LPM_CR;
	uint8_t Reserved7[2];
	__IO uint32_t LINK_LMP_PORT_CAP;
	__IO uint32_t LINK_LMP_RX_DATA0;
	__IO uint32_t LINK_LMP_RX_DATA1;
	__IO uint32_t LINK_LMP_RX_DATA2;
	__IO uint32_t LINK_LMP_TX_DATA0;
	__IO uint32_t LINK_LMP_TX_DATA1;
	__IO uint32_t LINK_LMP_TX_DATA2;

	__IO uint32_t USB_CONTROL;
	__IO uint32_t USB_STATUS;
	__IO uint32_t USB_ITP;
	__IO uint32_t USB_ITP_ADJ;
	__IO uint16_t UEP_TX_EN;
	__IO uint16_t UEP_RX_EN;

	__IO uint32_t UH_TX_CTRL;
	__IO uint32_t UH_RX_CTRL;
	__IO uint32_t UH_TX_DMA;
	__IO uint32_t UH_RX_DMA;
	__IO uint32_t UH_TX_DMA_OFS;
	__IO uint32_t UH_RX_DMA_OFS;
	__IO uint16_t HOST_TX_NUMP;
	__IO uint16_t HOST_RX_NUMP;
	__IO uint32_t HOST_STATUS;
	__IO uint16_t HOST_TX_FC_STATUS;
	__IO uint16_t HOST_RX_FC_STATUS;
	__IO uint32_t TP_RX_DATA0;
	__IO uint32_t TP_RX_DATA1;
	__IO uint32_t TP_RX_DATA2;
} USBSSH_TypeDef;

/* USBHS Device Registers */
typedef struct
{
	__IO uint8_t  CONTROL;
	__IO uint8_t  BASE_MODE;
	__IO uint8_t  INT_EN;
	__IO uint8_t  DEV_AD;
	__IO uint8_t  WAKE_CTRL;
	__IO uint8_t  TEST_MODE;
	__IO uint16_t LPM_DATA;

	__IO uint8_t  INT_FG;
	__IO uint8_t  INT_ST;
	__IO uint8_t  MIS_ST;
	uint8_t  RESERVED0;

	__IO uint16_t FRAME_NO;
	__IO uint16_t BUS;

	__IO uint16_t UEP_TX_EN;
	__IO uint16_t UEP_RX_EN;
	__IO uint16_t UEP_TX_TOG_AUTO;
	__IO uint16_t UEP_RX_TOG_AUTO;

