kholia/hal_wch/ch32fun/ch32h41xhw.h
	__IO uint8_t  UEP_TX_BURST;
	__IO uint8_t  UEP_TX_BURST_MODE;
	__IO uint8_t  UEP_RX_BURST;
	__IO uint8_t  UEP_RX_RES_MODE;

	__IO uint32_t UEP_AF_MODE;
	__IO uint32_t UEP0_DMA;
	__IO uint32_t UEP1_RX_DMA;
	__IO uint32_t UEP2_RX_DMA;
	__IO uint32_t UEP3_RX_DMA;
	__IO uint32_t UEP4_RX_DMA;
	__IO uint32_t UEP5_RX_DMA;
	__IO uint32_t UEP6_RX_DMA;
	__IO uint32_t UEP7_RX_DMA;
	__IO uint32_t UEP1_TX_DMA;
	__IO uint32_t UEP2_TX_DMA;
	__IO uint32_t UEP3_TX_DMA;
	__IO uint32_t UEP4_TX_DMA;
	__IO uint32_t UEP5_TX_DMA;
	__IO uint32_t UEP6_TX_DMA;
	__IO uint32_t UEP7_TX_DMA;
	__IO uint32_t UEP0_MAX_LEN;
	__IO uint32_t UEP1_MAX_LEN;
	__IO uint32_t UEP2_MAX_LEN;
	__IO uint32_t UEP3_MAX_LEN;
	__IO uint32_t UEP4_MAX_LEN;
	__IO uint32_t UEP5_MAX_LEN;
	__IO uint32_t UEP6_MAX_LEN;
	__IO uint32_t UEP7_MAX_LEN;

	__IO uint16_t UEP0_RX_LEN;
	uint16_t RESERVED1;
	__IO uint16_t UEP1_RX_LEN;
	__IO uint16_t UEP1_RX_SIZE;
	__IO uint16_t UEP2_RX_LEN;
	__IO uint16_t UEP2_RX_SIZE;
	__IO uint16_t UEP3_RX_LEN;
	__IO uint16_t UEP3_RX_SIZE;
	__IO uint16_t UEP4_RX_LEN;
	__IO uint16_t UEP4_RX_SIZE;
	__IO uint16_t UEP5_RX_LEN;
	__IO uint16_t UEP5_RX_SIZE;
	__IO uint16_t UEP6_RX_LEN;
	__IO uint16_t UEP6_RX_SIZE;
	__IO uint16_t UEP7_RX_LEN;
	__IO uint16_t UEP7_RX_SIZE;
	__IO uint16_t UEP0_TX_LEN;
	__IO uint8_t  UEP0_TX_CTRL;
	__IO uint8_t  UEP0_RX_CTRL;

	__IO uint16_t UEP1_TX_LEN;
	__IO uint8_t  UEP1_TX_CTRL;
	__IO uint8_t  UEP1_RX_CTRL;
	__IO uint16_t UEP2_TX_LEN;
	__IO uint8_t  UEP2_TX_CTRL;
	__IO uint8_t  UEP2_RX_CTRL;
	__IO uint16_t UEP3_TX_LEN;
	__IO uint8_t  UEP3_TX_CTRL;
	__IO uint8_t  UEP3_RX_CTRL;
	__IO uint16_t UEP4_TX_LEN;
	__IO uint8_t  UEP4_TX_CTRL;
	__IO uint8_t  UEP4_RX_CTRL;
	__IO uint16_t UEP5_TX_LEN;
	__IO uint8_t  UEP5_TX_CTRL;
	__IO uint8_t  UEP5_RX_CTRL;
	__IO uint16_t UEP6_TX_LEN;
	__IO uint8_t  UEP6_TX_CTRL;
	__IO uint8_t  UEP6_RX_CTRL;
	__IO uint16_t UEP7_TX_LEN;
	__IO uint8_t  UEP7_TX_CTRL;
	__IO uint8_t  UEP7_RX_CTRL;

	__IO uint16_t UEP_TX_ISO;
	__IO uint16_t UEP_RX_ISO;

	__IO uint32_t UEP1_RX_FIFO;
	__IO uint32_t UEP2_RX_FIFO;
	__IO uint32_t UEP3_RX_FIFO;
	__IO uint32_t UEP4_RX_FIFO;
	__IO uint32_t UEP5_RX_FIFO;
	__IO uint32_t UEP6_RX_FIFO;
	__IO uint32_t UEP7_RX_FIFO;
	__IO uint32_t UEP1_TX_FIFO;
	__IO uint32_t UEP2_TX_FIFO;
	__IO uint32_t UEP3_TX_FIFO;
	__IO uint32_t UEP4_TX_FIFO;
	__IO uint32_t UEP5_TX_FIFO;
	__IO uint32_t UEP6_TX_FIFO;
	__IO uint32_t UEP7_TX_FIFO;
} USBHSD_TypeDef;

/* USBHS Host Registers */
typedef struct  __attribute__((packed))
{
	__IO uint8_t  CFG;
	uint8_t  RESERVED0;
	__IO uint8_t  INT_EN;
	__IO uint8_t  DEV_ADDR;
	__IO uint32_t CONTROL;

	__IO uint8_t  INT_FLAG;
	__IO uint8_t  INT_ST;
	__IO uint8_t  MIS_ST;
	uint8_t  RESERVED1;

	__IO uint32_t LPM;
	__IO uint32_t SPLIT;
	__IO uint32_t FRAME;
	__IO uint32_t TX_LEN;
	__IO uint32_t RX_LEN;
	__IO uint32_t RX_MAX_LEN;
	__IO uint32_t RX_DMA;
	__IO uint32_t TX_DMA;
	__IO uint32_t PORT_CTRL;
	__IO uint8_t  PORT_CFG;
	uint8_t  RESERVED2;
	__IO uint8_t  PORT_INT_EN;
	__IO uint8_t  PORT_TEST_CT;

	__IO uint16_t PORT_STATUS;
	__IO uint8_t  PORT_STATUS_CHG;
	uint8_t  RESERVED3[5];
	__IO uint32_t ROOT_BC_CTRL;
} USBHSH_TypeDef;

/* USBFS Device Registers */
typedef struct
{
	__IO uint8_t  BASE_CTRL;
	__IO uint8_t  UDEV_CTRL;
	__IO uint8_t  INT_EN;
	__IO uint8_t  DEV_ADDR;
	uint8_t  RESERVED0;
	__IO uint8_t  MIS_ST;
	__IO uint8_t  INT_FG;
	__IO uint8_t  INT_ST;
	__IO uint16_t RX_LEN;

	uint16_t RESERVED1;
	__IO uint8_t  UEP4_1_MOD;
	__IO uint8_t  UEP2_3_MOD;
	__IO uint8_t  UEP5_6_MOD;
	__IO uint8_t  UEP7_MOD;
	__IO uint32_t UEP0_DMA;
	__IO uint32_t UEP1_DMA;
	__IO uint32_t UEP2_DMA;
	__IO uint32_t UEP3_DMA;
	__IO uint32_t UEP4_DMA;
	__IO uint32_t UEP5_DMA;
	__IO uint32_t UEP6_DMA;
	__IO uint32_t UEP7_DMA;
	__IO uint8_t  UEP0_TX_LEN;
	uint8_t  RESERVED2;
	__IO uint8_t  UEP0_TX_CTRL;
	__IO uint8_t  UEP0_RX_CTRL;
	__IO uint8_t  UEP1_TX_LEN;
	uint8_t  RESERVED3;
	__IO uint8_t  UEP1_TX_CTRL;
	__IO uint8_t  UEP1_RX_CTRL;
	__IO uint8_t  UEP2_TX_LEN;
	uint8_t  RESERVED4;
	__IO uint8_t  UEP2_TX_CTRL;
	__IO uint8_t  UEP2_RX_CTRL;
	__IO uint16_t UEP3_TX_LEN;
	__IO uint8_t  UEP3_TX_CTRL;
	__IO uint8_t  UEP3_RX_CTRL;
	__IO uint8_t  UEP4_TX_LEN;
	uint8_t  RESERVED5;
	__IO uint8_t  UEP4_TX_CTRL;
	__IO uint8_t  UEP4_RX_CTRL;
	__IO uint8_t  UEP5_TX_LEN;
	uint8_t  RESERVED6;
	__IO uint8_t  UEP5_TX_CTRL;
	__IO uint8_t  UEP5_RX_CTRL;
	__IO uint8_t  UEP6_TX_LEN;
	uint8_t  RESERVED7;
	__IO uint8_t  UEP6_TX_CTRL;
	__IO uint8_t  UEP6_RX_CTRL;
	__IO uint8_t  UEP7_TX_LEN;
	uint8_t  RESERVED8;
	__IO uint8_t  UEP7_TX_CTRL;
	__IO uint8_t  UEP7_RX_CTRL;
	uint32_t RESERVED9;
	__IO uint32_t OTG_CR;
	__IO uint32_t OTG_SR;
} USBFSD_TypeDef;

/* USBFS Host Registers */
typedef struct  __attribute__((packed))
{
	__IO uint8_t   BASE_CTRL;
	__IO uint8_t   HOST_CTRL;
	__IO uint8_t   INT_EN;
	__IO uint8_t   DEV_ADDR;
	uint8_t   RESERVED0;
	__IO uint8_t   MIS_ST;
	__IO uint8_t   INT_FG;
	__IO uint8_t   INT_ST;
	__IO uint16_t  RX_LEN;

	uint16_t  RESERVED1;
	uint8_t   RESERVED2;
	__IO uint8_t   HOST_EP_MOD;
	uint16_t  RESERVED3;
	uint32_t  RESERVED4;
	uint32_t  RESERVED5;
	__IO uint32_t  HOST_RX_DMA;
	__IO uint32_t  HOST_TX_DMA;
	uint32_t  RESERVED6;
	uint32_t  RESERVED7;
	uint32_t  RESERVED8;
	uint32_t  RESERVED9;
	uint32_t  RESERVED10;
	uint16_t  RESERVED11;
	__IO uint16_t  HOST_SETUP;
	__IO uint8_t   HOST_EP_PID;
	uint8_t   RESERVED12;
	uint8_t   RESERVED13;
	__IO uint8_t   HOST_RX_CTRL;
	__IO uint16_t  HOST_TX_LEN;
	__IO uint8_t   HOST_TX_CTRL;
	uint8_t   RESERVED14;
	uint32_t  RESERVED15;
	uint32_t  RESERVED16;
	uint32_t  RESERVED17;
	uint32_t  RESERVED18;
	uint32_t  RESERVED19;
	__IO uint32_t  OTG_CR;
	__IO uint32_t  OTG_SR;
} USBFSH_TypeDef;

/* Ethernet MAC Registers */
typedef struct
{
	__IO uint32_t MACCR;
	__IO uint32_t MACFFR;
	__IO uint32_t MACHTHR;
	__IO uint32_t MACHTLR;
	__IO uint32_t MACMIIAR;
	__IO uint32_t MACMIIDR;
	__IO uint32_t MACFCR;
	__IO uint32_t MACVLANTR;
	uint32_t RESERVED0[2];
	__IO uint32_t MACRWUFFR;
	__IO uint32_t MACPMTCSR;
	uint32_t RESERVED1[2];
	__IO uint32_t MACSR;
	__IO uint32_t MACIMR;
	__IO uint32_t MACA0HR;
	__IO uint32_t MACA0LR;
	__IO uint32_t MACA1HR;
	__IO uint32_t MACA1LR;
	__IO uint32_t MACA2HR;
	__IO uint32_t MACA2LR;
	__IO uint32_t MACA3HR;
	__IO uint32_t MACA3LR;
	uint32_t RESERVED2[8];
	__IO uint32_t MACPHYCR;
	uint32_t RESERVED3[5];
	__IO uint32_t MACCFG0;
	uint32_t RESERVED4[25];
	__IO uint32_t MMCCR;
	__IO uint32_t MMCRIR;
	__IO uint32_t MMCTIR;
	__IO uint32_t MMCRIMR;
	__IO uint32_t MMCTIMR;
	uint32_t RESERVED5[14];
	__IO uint32_t MMCTGFSCCR;
	__IO uint32_t MMCTGFMSCCR;
	uint32_t RESERVED6[5];
	__IO uint32_t MMCTGFCR;
	uint32_t RESERVED7[10];
	__IO uint32_t MMCRFCECR;
	__IO uint32_t MMCRFAECR;
	__IO uint32_t MMCRAFCR;
	uint32_t RESERVED8[9];
	__IO uint32_t MMCRGUFCR;
	uint32_t RESERVED9[334];
	__IO uint32_t PTPTSCR;
	__IO uint32_t PTPSSIR;
	__IO uint32_t PTPTSHR;
	__IO uint32_t PTPTSLR;
	__IO uint32_t PTPTSHUR;
	__IO uint32_t PTPTSLUR;
	__IO uint32_t PTPTSAR;
	__IO uint32_t PTPTTHR;
	__IO uint32_t PTPTTLR;
	uint32_t RESERVED10[567];
	__IO uint32_t DMABMR;
	__IO uint32_t DMATPDR;
	__IO uint32_t DMARPDR;
	__IO uint32_t DMARDLAR;
	__IO uint32_t DMATDLAR;
	__IO uint32_t DMASR;
	__IO uint32_t DMAOMR;
	__IO uint32_t DMAIER;
	__IO uint32_t DMAMFBOCR;
	uint32_t RESERVED11[9];
	__IO uint32_t DMACHTDR;
	__IO uint32_t DMACHRDR;
	__IO uint32_t DMACHTBAR;
	__IO uint32_t DMACHRBAR;
} ETH_TypeDef;

/* SDMMC Registers */
typedef struct
{
	__IO uint32_t ARGUMENT;
	__IO uint16_t CMD_SET;
	uint16_t RESERVED0;
	__IO uint32_t RESPONSE0;
	__IO uint32_t RESPONSE1;
	__IO uint32_t RESPONSE2;
	union
	{
		__IO uint32_t RESPONSE3;
		__IO uint32_t WRITE_CONT;
	};
	__IO uint16_t CONTROL;
	uint16_t RESERVED1;
	__IO uint8_t TIMEOUT;
	uint8_t RESERVED3[3];
	__IO uint32_t STATUS;
	__IO uint16_t INT_FG;
	uint16_t RESERVED4;
	__IO uint16_t INT_EN;
	uint16_t RESERVED5;
	__IO uint32_t DMA_BEG1;
	__IO uint32_t BLOCK_CFG;
	__IO uint32_t TRAN_MODE;
	__IO uint16_t CLK_DIV;
	uint16_t RESERVED6;
	__IO uint32_t DMA_BEG2;
	__IO uint32_t TUNE_DATO;
	__IO uint32_t TUNE_DATI;
	__IO uint32_t TUNE_CLK_CMD;
} SDMMC_TypeDef;

/* SAI Registers */
typedef struct
{
	__IO uint32_t CFGR1;
	__IO uint32_t CFGR2;
	__IO uint32_t FRCR;
	__IO uint32_t SLOTR;
	__IO uint32_t INTENR;
	__IO uint32_t SR;
	uint32_t RESERVED0;
	__IO uint32_t DATAR;
} SAI_Block_TypeDef;

