kholia/hal_wch/ch32fun/ch32h41xhw.h
/********************  Bit definition for CAN_F41R2 register  ********************/
#define CAN_F41R2_FB0                                ((uint32_t)0x00000001)
#define CAN_F41R2_FB1                                ((uint32_t)0x00000002)
#define CAN_F41R2_FB2                                ((uint32_t)0x00000004)
#define CAN_F41R2_FB3                                ((uint32_t)0x00000008)
#define CAN_F41R2_FB4                                ((uint32_t)0x00000010)
#define CAN_F41R2_FB5                                ((uint32_t)0x00000020)
#define CAN_F41R2_FB6                                ((uint32_t)0x00000040)
#define CAN_F41R2_FB7                                ((uint32_t)0x00000080)
#define CAN_F41R2_FB8                                ((uint32_t)0x00000100)
#define CAN_F41R2_FB9                                ((uint32_t)0x00000200)
#define CAN_F41R2_FB10                               ((uint32_t)0x00000400)
#define CAN_F41R2_FB11                               ((uint32_t)0x00000800)
#define CAN_F41R2_FB12                               ((uint32_t)0x00001000)
#define CAN_F41R2_FB13                               ((uint32_t)0x00002000)
#define CAN_F41R2_FB14                               ((uint32_t)0x00004000)
#define CAN_F41R2_FB15                               ((uint32_t)0x00008000)
#define CAN_F41R2_FB16                               ((uint32_t)0x00010000)
#define CAN_F41R2_FB17                               ((uint32_t)0x00020000)
#define CAN_F41R2_FB18                               ((uint32_t)0x00040000)
#define CAN_F41R2_FB19                               ((uint32_t)0x00080000)
#define CAN_F41R2_FB20                               ((uint32_t)0x00100000)
#define CAN_F41R2_FB21                               ((uint32_t)0x00200000)
#define CAN_F41R2_FB22                               ((uint32_t)0x00400000)
#define CAN_F41R2_FB23                               ((uint32_t)0x00800000)
#define CAN_F41R2_FB24                               ((uint32_t)0x01000000)
#define CAN_F41R2_FB25                               ((uint32_t)0x02000000)
#define CAN_F41R2_FB26                               ((uint32_t)0x04000000)
#define CAN_F41R2_FB27                               ((uint32_t)0x08000000)
#define CAN_F41R2_FB28                               ((uint32_t)0x10000000)
#define CAN_F41R2_FB29                               ((uint32_t)0x20000000)
#define CAN_F41R2_FB30                               ((uint32_t)0x40000000)
#define CAN_F41R2_FB31                               ((uint32_t)0x80000000)

/******************************************************************************/
/*                          CRC Calculation Unit                              */
/******************************************************************************/

/*******************  Bit definition for CRC_DATAR register  *********************/
#define  CRC_DATAR_DR                                ((uint32_t)0xFFFFFFFF) /* Data register bits */

/*******************  Bit definition for CRC_IDATAR register  ********************/
#define  CRC_IDR_IDATAR                              ((uint8_t)0xFF)        /* General-purpose 8-bit data register bits */

/********************  Bit definition for CRC_CTLR register  ********************/
#define  CRC_CTLR_RESET                              ((uint8_t)0x01)        /* RESET bit */

/******************************************************************************/
/*                      Digital to Analog Converter                           */
/******************************************************************************/

/********************  Bit definition for DAC_CTLR register  ********************/
#define  DAC_EN1                                     ((uint32_t)0x00000001)        /* DAC channel1 enable */
#define  DAC_BOFF1                                   ((uint32_t)0x00000002)        /* DAC channel1 output buffer disable */
#define  DAC_TEN1                                    ((uint32_t)0x00000004)        /* DAC channel1 Trigger enable */

#define  DAC_TSEL1                                   ((uint32_t)0x00000038)        /* TSEL1[2:0] (DAC channel1 Trigger selection) */
#define  DAC_TSEL1_0                                 ((uint32_t)0x00000008)        /* Bit 0 */
#define  DAC_TSEL1_1                                 ((uint32_t)0x00000010)        /* Bit 1 */
#define  DAC_TSEL1_2                                 ((uint32_t)0x00000020)        /* Bit 2 */

#define  DAC_WAVE1                                   ((uint32_t)0x000000C0)        /* WAVE1[1:0] (DAC channel1 noise/triangle wave generation enable) */
#define  DAC_WAVE1_0                                 ((uint32_t)0x00000040)        /* Bit 0 */
#define  DAC_WAVE1_1                                 ((uint32_t)0x00000080)        /* Bit 1 */

#define  DAC_MAMP1                                   ((uint32_t)0x00000F00)        /* MAMP1[3:0] (DAC channel1 Mask/Amplitude selector) */
#define  DAC_MAMP1_0                                 ((uint32_t)0x00000100)        /* Bit 0 */
#define  DAC_MAMP1_1                                 ((uint32_t)0x00000200)        /* Bit 1 */
#define  DAC_MAMP1_2                                 ((uint32_t)0x00000400)        /* Bit 2 */
#define  DAC_MAMP1_3                                 ((uint32_t)0x00000800)        /* Bit 3 */

#define  DAC_DMAEN1                                  ((uint32_t)0x00001000)        /* DAC channel1 DMA enable */
#define  DAC_EN2                                     ((uint32_t)0x00010000)        /* DAC channel2 enable */
#define  DAC_BOFF2                                   ((uint32_t)0x00020000)        /* DAC channel2 output buffer disable */
#define  DAC_TEN2                                    ((uint32_t)0x00040000)        /* DAC channel2 Trigger enable */

#define  DAC_TSEL2                                   ((uint32_t)0x00380000)        /* TSEL2[2:0] (DAC channel2 Trigger selection) */
#define  DAC_TSEL2_0                                 ((uint32_t)0x00080000)        /* Bit 0 */
#define  DAC_TSEL2_1                                 ((uint32_t)0x00100000)        /* Bit 1 */
#define  DAC_TSEL2_2                                 ((uint32_t)0x00200000)        /* Bit 2 */

#define  DAC_WAVE2                                   ((uint32_t)0x00C00000)        /* WAVE2[1:0] (DAC channel2 noise/triangle wave generation enable) */
#define  DAC_WAVE2_0                                 ((uint32_t)0x00400000)        /* Bit 0 */
#define  DAC_WAVE2_1                                 ((uint32_t)0x00800000)        /* Bit 1 */

#define  DAC_MAMP2                                   ((uint32_t)0x0F000000)        /* MAMP2[3:0] (DAC channel2 Mask/Amplitude selector) */
#define  DAC_MAMP2_0                                 ((uint32_t)0x01000000)        /* Bit 0 */
#define  DAC_MAMP2_1                                 ((uint32_t)0x02000000)        /* Bit 1 */
#define  DAC_MAMP2_2                                 ((uint32_t)0x04000000)        /* Bit 2 */
#define  DAC_MAMP2_3                                 ((uint32_t)0x08000000)        /* Bit 3 */

#define  DAC_DMAEN2                                  ((uint32_t)0x10000000)        /* DAC channel2 DMA enabled */

/*****************  Bit definition for DAC_SWTR register  ******************/
#define  DAC_SWTRIG1                                 ((uint8_t)0x01)               /* DAC channel1 software trigger */
#define  DAC_SWTRIG2                                 ((uint8_t)0x02)               /* DAC channel2 software trigger */

/*****************  Bit definition for DAC_R12BDHR1 register  ******************/
#define  DAC_DHR12R1                                 ((uint16_t)0x0FFF)            /* DAC channel1 12-bit Right aligned data */

/*****************  Bit definition for DAC_L12BDHR1 register  ******************/
#define  DAC_DHR12L1                                 ((uint16_t)0xFFF0)            /* DAC channel1 12-bit Left aligned data */

/******************  Bit definition for DAC_R8BDHR1 register  ******************/
#define  DAC_DHR8R1                                  ((uint8_t)0xFF)               /* DAC channel1 8-bit Right aligned data */

/*****************  Bit definition for DAC_R12BDHR2 register  ******************/
#define  DAC_DHR12R2                                 ((uint16_t)0x0FFF)            /* DAC channel2 12-bit Right aligned data */

