kholia/hal_wch/ch32fun/ch32h41xhw.h
#define  GPIO_CFGHR_MODE14                           ((uint32_t)0x03000000)        /* MODE14[1:0] bits (Port x mode bits, pin 14) */
#define  GPIO_CFGHR_MODE14_0                         ((uint32_t)0x01000000)        /* Bit 0 */
#define  GPIO_CFGHR_MODE14_1                         ((uint32_t)0x02000000)        /* Bit 1 */

#define  GPIO_CFGHR_MODE15                           ((uint32_t)0x30000000)        /* MODE15[1:0] bits (Port x mode bits, pin 15) */
#define  GPIO_CFGHR_MODE15_0                         ((uint32_t)0x10000000)        /* Bit 0 */
#define  GPIO_CFGHR_MODE15_1                         ((uint32_t)0x20000000)        /* Bit 1 */

#define  GPIO_CFGHR_CNF                              ((uint32_t)0xCCCCCCCC)        /* Port x configuration bits */

#define  GPIO_CFGHR_CNF8                             ((uint32_t)0x0000000C)        /* CNF8[1:0] bits (Port x configuration bits, pin 8) */
#define  GPIO_CFGHR_CNF8_0                           ((uint32_t)0x00000004)        /* Bit 0 */
#define  GPIO_CFGHR_CNF8_1                           ((uint32_t)0x00000008)        /* Bit 1 */

#define  GPIO_CFGHR_CNF9                             ((uint32_t)0x000000C0)        /* CNF9[1:0] bits (Port x configuration bits, pin 9) */
#define  GPIO_CFGHR_CNF9_0                           ((uint32_t)0x00000040)        /* Bit 0 */
#define  GPIO_CFGHR_CNF9_1                           ((uint32_t)0x00000080)        /* Bit 1 */

#define  GPIO_CFGHR_CNF10                            ((uint32_t)0x00000C00)        /* CNF10[1:0] bits (Port x configuration bits, pin 10) */
#define  GPIO_CFGHR_CNF10_0                          ((uint32_t)0x00000400)        /* Bit 0 */
#define  GPIO_CFGHR_CNF10_1                          ((uint32_t)0x00000800)        /* Bit 1 */

#define  GPIO_CFGHR_CNF11                            ((uint32_t)0x0000C000)        /* CNF11[1:0] bits (Port x configuration bits, pin 11) */
#define  GPIO_CFGHR_CNF11_0                          ((uint32_t)0x00004000)        /* Bit 0 */
#define  GPIO_CFGHR_CNF11_1                          ((uint32_t)0x00008000)        /* Bit 1 */

#define  GPIO_CFGHR_CNF12                            ((uint32_t)0x000C0000)        /* CNF12[1:0] bits (Port x configuration bits, pin 12) */
#define  GPIO_CFGHR_CNF12_0                          ((uint32_t)0x00040000)        /* Bit 0 */
#define  GPIO_CFGHR_CNF12_1                          ((uint32_t)0x00080000)        /* Bit 1 */

#define  GPIO_CFGHR_CNF13                            ((uint32_t)0x00C00000)        /* CNF13[1:0] bits (Port x configuration bits, pin 13) */
#define  GPIO_CFGHR_CNF13_0                          ((uint32_t)0x00400000)        /* Bit 0 */
#define  GPIO_CFGHR_CNF13_1                          ((uint32_t)0x00800000)        /* Bit 1 */

#define  GPIO_CFGHR_CNF14                            ((uint32_t)0x0C000000)        /* CNF14[1:0] bits (Port x configuration bits, pin 14) */
#define  GPIO_CFGHR_CNF14_0                          ((uint32_t)0x04000000)        /* Bit 0 */
#define  GPIO_CFGHR_CNF14_1                          ((uint32_t)0x08000000)        /* Bit 1 */

#define  GPIO_CFGHR_CNF15                            ((uint32_t)0xC0000000)        /* CNF15[1:0] bits (Port x configuration bits, pin 15) */
#define  GPIO_CFGHR_CNF15_0                          ((uint32_t)0x40000000)        /* Bit 0 */
#define  GPIO_CFGHR_CNF15_1                          ((uint32_t)0x80000000)        /* Bit 1 */

/*******************  Bit definition for GPIO_INDR register  *******************/
#define GPIO_INDR_IDR0                               ((uint16_t)0x0001)            /* Port input data, bit 0 */
#define GPIO_INDR_IDR1                               ((uint16_t)0x0002)            /* Port input data, bit 1 */
#define GPIO_INDR_IDR2                               ((uint16_t)0x0004)            /* Port input data, bit 2 */
#define GPIO_INDR_IDR3                               ((uint16_t)0x0008)            /* Port input data, bit 3 */
#define GPIO_INDR_IDR4                               ((uint16_t)0x0010)            /* Port input data, bit 4 */
#define GPIO_INDR_IDR5                               ((uint16_t)0x0020)            /* Port input data, bit 5 */
#define GPIO_INDR_IDR6                               ((uint16_t)0x0040)            /* Port input data, bit 6 */
#define GPIO_INDR_IDR7                               ((uint16_t)0x0080)            /* Port input data, bit 7 */
#define GPIO_INDR_IDR8                               ((uint16_t)0x0100)            /* Port input data, bit 8 */
#define GPIO_INDR_IDR9                               ((uint16_t)0x0200)            /* Port input data, bit 9 */
#define GPIO_INDR_IDR10                              ((uint16_t)0x0400)            /* Port input data, bit 10 */
#define GPIO_INDR_IDR11                              ((uint16_t)0x0800)            /* Port input data, bit 11 */
#define GPIO_INDR_IDR12                              ((uint16_t)0x1000)            /* Port input data, bit 12 */
#define GPIO_INDR_IDR13                              ((uint16_t)0x2000)            /* Port input data, bit 13 */
#define GPIO_INDR_IDR14                              ((uint16_t)0x4000)            /* Port input data, bit 14 */
#define GPIO_INDR_IDR15                              ((uint16_t)0x8000)            /* Port input data, bit 15 */

/*******************  Bit definition for GPIO_OUTDR register  *******************/
#define GPIO_OUTDR_ODR0                              ((uint16_t)0x0001)            /* Port output data, bit 0 */
#define GPIO_OUTDR_ODR1                              ((uint16_t)0x0002)            /* Port output data, bit 1 */
#define GPIO_OUTDR_ODR2                              ((uint16_t)0x0004)            /* Port output data, bit 2 */
#define GPIO_OUTDR_ODR3                              ((uint16_t)0x0008)            /* Port output data, bit 3 */
#define GPIO_OUTDR_ODR4                              ((uint16_t)0x0010)            /* Port output data, bit 4 */
#define GPIO_OUTDR_ODR5                              ((uint16_t)0x0020)            /* Port output data, bit 5 */
#define GPIO_OUTDR_ODR6                              ((uint16_t)0x0040)            /* Port output data, bit 6 */
#define GPIO_OUTDR_ODR7                              ((uint16_t)0x0080)            /* Port output data, bit 7 */
#define GPIO_OUTDR_ODR8                              ((uint16_t)0x0100)            /* Port output data, bit 8 */
#define GPIO_OUTDR_ODR9                              ((uint16_t)0x0200)            /* Port output data, bit 9 */
#define GPIO_OUTDR_ODR10                             ((uint16_t)0x0400)            /* Port output data, bit 10 */
#define GPIO_OUTDR_ODR11                             ((uint16_t)0x0800)            /* Port output data, bit 11 */
#define GPIO_OUTDR_ODR12                             ((uint16_t)0x1000)            /* Port output data, bit 12 */
#define GPIO_OUTDR_ODR13                             ((uint16_t)0x2000)            /* Port output data, bit 13 */
#define GPIO_OUTDR_ODR14                             ((uint16_t)0x4000)            /* Port output data, bit 14 */
#define GPIO_OUTDR_ODR15                             ((uint16_t)0x8000)            /* Port output data, bit 15 */

/******************  Bit definition for GPIO_BSHR register  *******************/
#define GPIO_BSHR_BS0                                ((uint32_t)0x00000001)        /* Port x Set bit 0 */
#define GPIO_BSHR_BS1                                ((uint32_t)0x00000002)        /* Port x Set bit 1 */
#define GPIO_BSHR_BS2                                ((uint32_t)0x00000004)        /* Port x Set bit 2 */
#define GPIO_BSHR_BS3                                ((uint32_t)0x00000008)        /* Port x Set bit 3 */
#define GPIO_BSHR_BS4                                ((uint32_t)0x00000010)        /* Port x Set bit 4 */
#define GPIO_BSHR_BS5                                ((uint32_t)0x00000020)        /* Port x Set bit 5 */
#define GPIO_BSHR_BS6                                ((uint32_t)0x00000040)        /* Port x Set bit 6 */
#define GPIO_BSHR_BS7                                ((uint32_t)0x00000080)        /* Port x Set bit 7 */
#define GPIO_BSHR_BS8                                ((uint32_t)0x00000100)        /* Port x Set bit 8 */
#define GPIO_BSHR_BS9                                ((uint32_t)0x00000200)        /* Port x Set bit 9 */
#define GPIO_BSHR_BS10                               ((uint32_t)0x00000400)        /* Port x Set bit 10 */
#define GPIO_BSHR_BS11                               ((uint32_t)0x00000800)        /* Port x Set bit 11 */
#define GPIO_BSHR_BS12                               ((uint32_t)0x00001000)        /* Port x Set bit 12 */
#define GPIO_BSHR_BS13                               ((uint32_t)0x00002000)        /* Port x Set bit 13 */
#define GPIO_BSHR_BS14                               ((uint32_t)0x00004000)        /* Port x Set bit 14 */
#define GPIO_BSHR_BS15                               ((uint32_t)0x00008000)        /* Port x Set bit 15 */

