kholia/hal_wch/ch32fun/ch32h41xhw.h
/******************  Bit definition for AFIO_EXTICR1 register  *******************/
#define AFIO_EXTICR1_EXTI0                           ((uint32_t)0x0000000F)        /* EXTI 0 configuration */
#define AFIO_EXTICR1_EXTI1                           ((uint32_t)0x000000F0)        /* EXTI 1 configuration */
#define AFIO_EXTICR1_EXTI2                           ((uint32_t)0x00000F00)        /* EXTI 2 configuration */
#define AFIO_EXTICR1_EXTI3                           ((uint32_t)0x0000F000)        /* EXTI 3 configuration */
#define AFIO_EXTICR1_EXTI4                           ((uint32_t)0x000F0000)        /* EXTI 4 configuration */
#define AFIO_EXTICR1_EXTI5                           ((uint32_t)0x00F00000)        /* EXTI 5 configuration */
#define AFIO_EXTICR1_EXTI6                           ((uint32_t)0x0F000000)        /* EXTI 6 configuration */
#define AFIO_EXTICR1_EXTI7                           ((uint32_t)0xF0000000)        /* EXTI 7 configuration */

#define AFIO_EXTICR1_EXTI0_PA                        ((uint32_t)0x00000000)            /* PA[0] pin */
#define AFIO_EXTICR1_EXTI0_PB                        ((uint32_t)0x00000001)            /* PB[0] pin */
#define AFIO_EXTICR1_EXTI0_PC                        ((uint32_t)0x00000002)            /* PC[0] pin */
#define AFIO_EXTICR1_EXTI0_PD                        ((uint32_t)0x00000003)            /* PD[0] pin */
#define AFIO_EXTICR1_EXTI0_PE                        ((uint32_t)0x00000004)            /* PE[0] pin */
#define AFIO_EXTICR1_EXTI0_PF                        ((uint32_t)0x00000005)            /* PF[0] pin */
#define AFIO_EXTICR1_EXTI0_CMPOUT                    ((uint32_t)0x00000006)            /* CMP OUT */

#define AFIO_EXTICR1_EXTI1_PA                        ((uint32_t)0x00000000)            /* PA[1] pin */
#define AFIO_EXTICR1_EXTI1_PB                        ((uint32_t)0x00000010)            /* PB[1] pin */
#define AFIO_EXTICR1_EXTI1_PC                        ((uint32_t)0x00000020)            /* PC[1] pin */
#define AFIO_EXTICR1_EXTI1_PD                        ((uint32_t)0x00000030)            /* PD[1] pin */
#define AFIO_EXTICR1_EXTI1_PE                        ((uint32_t)0x00000040)            /* PE[1] pin */
#define AFIO_EXTICR1_EXTI1_PF                        ((uint32_t)0x00000050)            /* PF[1] pin */
#define AFIO_EXTICR1_EXTI1_CMPOUT                    ((uint32_t)0x00000060)            /* CMP OUT */

#define AFIO_EXTICR1_EXTI2_PA                        ((uint32_t)0x00000000)            /* PA[2] pin */
#define AFIO_EXTICR1_EXTI2_PB                        ((uint32_t)0x00000100)            /* PB[2] pin */
#define AFIO_EXTICR1_EXTI2_PC                        ((uint32_t)0x00000200)            /* PC[2] pin */
#define AFIO_EXTICR1_EXTI2_PD                        ((uint32_t)0x00000300)            /* PD[2] pin */
#define AFIO_EXTICR1_EXTI2_PE                        ((uint32_t)0x00000400)            /* PE[2] pin */
#define AFIO_EXTICR1_EXTI2_PF                        ((uint32_t)0x00000500)            /* PF[2] pin */
#define AFIO_EXTICR1_EXTI2_CMPOUT                    ((uint32_t)0x00000600)            /* CMP OUT */

#define AFIO_EXTICR1_EXTI3_PA                        ((uint32_t)0x00000000)            /* PA[3] pin */
#define AFIO_EXTICR1_EXTI3_PB                        ((uint32_t)0x00001000)            /* PB[3] pin */
#define AFIO_EXTICR1_EXTI3_PC                        ((uint32_t)0x00002000)            /* PC[3] pin */
#define AFIO_EXTICR1_EXTI3_PD                        ((uint32_t)0x00003000)            /* PD[3] pin */
#define AFIO_EXTICR1_EXTI3_PE                        ((uint32_t)0x00004000)            /* PE[3] pin */
#define AFIO_EXTICR1_EXTI3_PF                        ((uint32_t)0x00005000)            /* PF[3] pin */
#define AFIO_EXTICR1_EXTI3_CMPOUT                    ((uint32_t)0x00006000)            /* CMP OUT */

#define AFIO_EXTICR1_EXTI4_PA                        ((uint32_t)0x00000000)            /* PA[4] pin */
#define AFIO_EXTICR1_EXTI4_PB                        ((uint32_t)0x00010000)            /* PB[4] pin */
#define AFIO_EXTICR1_EXTI4_PC                        ((uint32_t)0x00020000)            /* PC[4] pin */
#define AFIO_EXTICR1_EXTI4_PD                        ((uint32_t)0x00030000)            /* PD[4] pin */
#define AFIO_EXTICR1_EXTI4_PE                        ((uint32_t)0x00040000)            /* PE[4] pin */
#define AFIO_EXTICR1_EXTI4_PF                        ((uint32_t)0x00050000)            /* PF[4] pin */
#define AFIO_EXTICR1_EXTI4_CMPOUT                    ((uint32_t)0x00060000)            /* CMP OUT */

#define AFIO_EXTICR1_EXTI5_PA                        ((uint32_t)0x00000000)            /* PA[5] pin */
#define AFIO_EXTICR1_EXTI5_PB                        ((uint32_t)0x00100000)            /* PB[5] pin */
#define AFIO_EXTICR1_EXTI5_PC                        ((uint32_t)0x00200000)            /* PC[5] pin */
#define AFIO_EXTICR1_EXTI5_PD                        ((uint32_t)0x00300000)            /* PD[5] pin */
#define AFIO_EXTICR1_EXTI5_PE                        ((uint32_t)0x00400000)            /* PE[5] pin */
#define AFIO_EXTICR1_EXTI5_PF                        ((uint32_t)0x00500000)            /* PF[5] pin */
#define AFIO_EXTICR1_EXTI5_CMPOUT                    ((uint32_t)0x00600000)            /* CMP OUT */

#define AFIO_EXTICR1_EXTI6_PA                        ((uint32_t)0x00000000)            /* PA[6] pin */
#define AFIO_EXTICR1_EXTI6_PB                        ((uint32_t)0x01000000)            /* PB[6] pin */
#define AFIO_EXTICR1_EXTI6_PC                        ((uint32_t)0x02000000)            /* PC[6] pin */
#define AFIO_EXTICR1_EXTI6_PD                        ((uint32_t)0x03000000)            /* PD[6] pin */
#define AFIO_EXTICR1_EXTI6_PE                        ((uint32_t)0x04000000)            /* PE[6] pin */
#define AFIO_EXTICR1_EXTI6_PF                        ((uint32_t)0x05000000)            /* PF[6] pin */
#define AFIO_EXTICR1_EXTI6_CMPOUT                    ((uint32_t)0x06000000)            /* CMP OUT */

