kholia/hal_wch/ch32fun/ch32h41xhw.h
#define  RCC_SWS_HSI                                 ((uint32_t)0x00000000)        /* HSI oscillator used as system clock */
#define  RCC_SWS_HSE                                 ((uint32_t)0x00000004)        /* HSE oscillator used as system clock */
#define  RCC_SWS_PLL                                 ((uint32_t)0x00000008)        /* PLL used as system clock */

#define  RCC_HPRE                                    ((uint32_t)0x000000F0)        /* HPRE[3:0] bits (AHB prescaler) */
#define  RCC_HPRE_0                                  ((uint32_t)0x00000010)        /* Bit 0 */
#define  RCC_HPRE_1                                  ((uint32_t)0x00000020)        /* Bit 1 */
#define  RCC_HPRE_2                                  ((uint32_t)0x00000040)        /* Bit 2 */
#define  RCC_HPRE_3                                  ((uint32_t)0x00000080)        /* Bit 3 */

#define  RCC_HPRE_DIV1                               ((uint32_t)0x00000000)        /* SYSCLK not divided */
#define  RCC_HPRE_DIV2                               ((uint32_t)0x00000080)        /* SYSCLK divided by 2 */
#define  RCC_HPRE_DIV4                               ((uint32_t)0x00000090)        /* SYSCLK divided by 4 */
#define  RCC_HPRE_DIV8                               ((uint32_t)0x000000A0)        /* SYSCLK divided by 8 */
#define  RCC_HPRE_DIV16                              ((uint32_t)0x000000B0)        /* SYSCLK divided by 16 */
#define  RCC_HPRE_DIV64                              ((uint32_t)0x000000C0)        /* SYSCLK divided by 64 */
#define  RCC_HPRE_DIV128                             ((uint32_t)0x000000D0)        /* SYSCLK divided by 128 */
#define  RCC_HPRE_DIV256                             ((uint32_t)0x000000E0)        /* SYSCLK divided by 256 */
#define  RCC_HPRE_DIV512                             ((uint32_t)0x000000F0)        /* SYSCLK divided by 512 */

#define  RCC_PPRE1                                   ((uint32_t)0x00000700)        /* PRE1[2:0] bits (APB1 prescaler) */
#define  RCC_PPRE1_0                                 ((uint32_t)0x00000100)        /* Bit 0 */
#define  RCC_PPRE1_1                                 ((uint32_t)0x00000200)        /* Bit 1 */
#define  RCC_PPRE1_2                                 ((uint32_t)0x00000400)        /* Bit 2 */

#define  RCC_PPRE1_DIV1                              ((uint32_t)0x00000000)        /* HCLK not divided */
#define  RCC_PPRE1_DIV2                              ((uint32_t)0x00000500)        /* HCLK divided by 2 */
#define  RCC_PPRE1_DIV4                              ((uint32_t)0x00000600)        /* HCLK divided by 4 */
#define  RCC_PPRE1_DIV8                              ((uint32_t)0x00000700)        /* HCLK divided by 8 */

#define  RCC_PPRE2                                   ((uint32_t)0x00003800)        /* PRE2[2:0] bits (APB2 prescaler) */
#define  RCC_PPRE2_0                                 ((uint32_t)0x00000800)        /* Bit 0 */
#define  RCC_PPRE2_1                                 ((uint32_t)0x00001000)        /* Bit 1 */
#define  RCC_PPRE2_2                                 ((uint32_t)0x00002000)        /* Bit 2 */

#define  RCC_PPRE2_TIM_DIV1                          ((uint32_t)0x00000000)        /* HCLK divided by 1 for TIM1,8,9,10*/
#define  RCC_PPRE2_TIM_DIV2                          ((uint32_t)0x00002800)        /* HCLK divided by 2 for TIM1,8,9,10*/
#define  RCC_PPRE2_TIM_DIV4                          ((uint32_t)0x00003000)        /* HCLK divided by 4 for TIM1,8,9,10*/
#define  RCC_PPRE2_TIM_DIV8                          ((uint32_t)0x00003800)        /* HCLK divided by 8 for TIM1,8,9,10*/

#define  RCC_PPRE2_ADCL_DIV1                         ((uint32_t)0x00000000)        /* HCLK divided by 1 for ADC*/
#define  RCC_PPRE2_ADCL_DIV2                         ((uint32_t)0x00002000)        /* HCLK divided by 2 for ADC*/
#define  RCC_PPRE2_ADCL_DIV4                         ((uint32_t)0x00002800)        /* HCLK divided by 4 for ADC*/
#define  RCC_PPRE2_ADCL_DIV8                         ((uint32_t)0x00003000)        /* HCLK divided by 8 for ADC*/
#define  RCC_PPRE2_ADCL_DIV16                        ((uint32_t)0x00003800)        /* HCLK divided by 16 for ADC*/

#define  RCC_ADCPRE                                  ((uint32_t)0x0000C000)        /* ADCPRE[1:0] bits (ADC prescaler) */
#define  RCC_ADCPRE_0                                ((uint32_t)0x00004000)        /* Bit 0 */
#define  RCC_ADCPRE_1                                ((uint32_t)0x00008000)        /* Bit 1 */

#define  RCC_ADCPRE_ADCH_DIV2                        ((uint32_t)0x00000000)        /* HCLK divided by 2 for ADC*/
#define  RCC_ADCPRE_ADCH_DIV4                        ((uint32_t)0x00001000)        /* HCLK divided by 4 for ADC*/
#define  RCC_ADCPRE_ADCH_DIV6                        ((uint32_t)0x00002000)        /* HCLK divided by 6 for ADC*/
#define  RCC_ADCPRE_ADCH_DIV8                        ((uint32_t)0x00003000)        /* HCLK divided by 8 for ADC*/

#define  RCC_ADCPRE_DIV5                             ((uint32_t)0x00000000)        /* USBHS PLL divided by 5 for ADC */
#define  RCC_ADCPRE_DIV6                             ((uint32_t)0x00000800)        /* USBHS PLL divided by 6 for ADC */
#define  RCC_ADCPRE_DIV7                             ((uint32_t)0x00001000)        /* USBHS PLL divided by 7 for ADC */
#define  RCC_ADCPRE_DIV8                             ((uint32_t)0x00001800)        /* USBHS PLL divided by 8 for ADC */
#define  RCC_ADCPRE_DIV9                             ((uint32_t)0x00002000)        /* USBHS PLL divided by 9 for ADC */
#define  RCC_ADCPRE_DIV10                            ((uint32_t)0x00002800)        /* USBHS PLL divided by 10 for ADC */
#define  RCC_ADCPRE_DIV11                            ((uint32_t)0x00003000)        /* USBHS PLL divided by 11 for ADC */
#define  RCC_ADCPRE_DIV12                            ((uint32_t)0x00003800)        /* USBHS PLL divided by 12 for ADC */
#define  RCC_ADCPRE_DIV13                            ((uint32_t)0x00004000)        /* USBHS PLL divided by 13 for ADC */
#define  RCC_ADCPRE_DIV14                            ((uint32_t)0x00004800)        /* USBHS PLL divided by 14 for ADC */
#define  RCC_ADCPRE_DIV15                            ((uint32_t)0x00005000)        /* USBHS PLL divided by 15 for ADC */
#define  RCC_ADCPRE_DIV16                            ((uint32_t)0x00005800)        /* USBHS PLL divided by 16 for ADC */
#define  RCC_ADCPRE_DIV17                            ((uint32_t)0x00006000)        /* USBHS PLL divided by 17 for ADC */
#define  RCC_ADCPRE_DIV18                            ((uint32_t)0x00006800)        /* USBHS PLL divided by 18 for ADC */
#define  RCC_ADCPRE_DIV19                            ((uint32_t)0x00007000)        /* USBHS PLL divided by 19 for ADC */
#define  RCC_ADCPRE_DIV20                            ((uint32_t)0x00007800)        /* USBHS PLL divided by 20 for ADC */
#define  RCC_ADCPRE_DIV21                            ((uint32_t)0x00008000)        /* USBHS PLL divided by 21 for ADC */
#define  RCC_ADCPRE_DIV22                            ((uint32_t)0x00008800)        /* USBHS PLL divided by 22 for ADC */
#define  RCC_ADCPRE_DIV23                            ((uint32_t)0x00009000)        /* USBHS PLL divided by 23 for ADC */
#define  RCC_ADCPRE_DIV24                            ((uint32_t)0x00009800)        /* USBHS PLL divided by 24 for ADC */
#define  RCC_ADCPRE_DIV25                            ((uint32_t)0x0000A000)        /* USBHS PLL divided by 25 for ADC */
#define  RCC_ADCPRE_DIV26                            ((uint32_t)0x0000A800)        /* USBHS PLL divided by 26 for ADC */
#define  RCC_ADCPRE_DIV27                            ((uint32_t)0x0000B000)        /* USBHS PLL divided by 27 for ADC */
#define  RCC_ADCPRE_DIV28                            ((uint32_t)0x0000B800)        /* USBHS PLL divided by 28 for ADC */
#define  RCC_ADCPRE_DIV29                            ((uint32_t)0x0000C000)        /* USBHS PLL divided by 29 for ADC */
#define  RCC_ADCPRE_DIV30                            ((uint32_t)0x0000C800)        /* USBHS PLL divided by 30 for ADC */
#define  RCC_ADCPRE_DIV31                            ((uint32_t)0x0000D000)        /* USBHS PLL divided by 31 for ADC */
#define  RCC_ADCPRE_DIV32                            ((uint32_t)0x0000D800)        /* USBHS PLL divided by 32 for ADC */
#define  RCC_ADCPRE_DIV33                            ((uint32_t)0x0000E000)        /* USBHS PLL divided by 33 for ADC */
#define  RCC_ADCPRE_DIV34                            ((uint32_t)0x0000E800)        /* USBHS PLL divided by 34 for ADC */
#define  RCC_ADCPRE_DIV35                            ((uint32_t)0x0000F000)        /* USBHS PLL divided by 35 for ADC */
#define  RCC_ADCPRE_DIV36                            ((uint32_t)0x0000F800)        /* USBHS PLL divided by 36 for ADC */

#define  RCC_FPRE                                    ((uint32_t)0x00030000)
#define  RCC_FPRE_0                                  ((uint32_t)0x00010000)
#define  RCC_FPRE_1                                  ((uint32_t)0x00020000)

#define  RCC_FPRE_DIV1                               ((uint32_t)0x00000000)
#define  RCC_FPRE_DIV2                               ((uint32_t)0x00010000)
#define  RCC_FPRE_DIV4                               ((uint32_t)0x00020000)

#define  RCC_RGMIION                                 ((uint32_t)0x00200000)

#define  RCC_PIPEON                                  ((uint32_t)0x00400000)
#define  RCC_UTMION                                  ((uint32_t)0x00800000)

#define  RCC_CFGR0_MCO                               ((uint32_t)0x0F000000)
#define  RCC_MCO_0                                   ((uint32_t)0x01000000)
#define  RCC_MCO_1                                   ((uint32_t)0x02000000)
#define  RCC_MCO_2                                   ((uint32_t)0x04000000)
#define  RCC_MCO_3                                   ((uint32_t)0x08000000)

#define  RCC_CFGR0_MCO_NOCLOCK                       ((uint32_t)0x00000000)
#define  RCC_CFGR0_MCO_SYSCLK                        ((uint32_t)0x04000000)
#define  RCC_CFGR0_MCO_HSI                           ((uint32_t)0x05000000)
#define  RCC_CFGR0_MCO_HSE                           ((uint32_t)0x06000000)
#define  RCC_CFGR0_MCO_PLL_DIV2                      ((uint32_t)0x07000000)
#define  RCC_CFGR0_MCO_UTMI                          ((uint32_t)0x08000000)
#define  RCC_CFGR0_MCO_USBSS_PLL_DIV2                ((uint32_t)0x09000000)
#define  RCC_CFGR0_MCO_ETH_PLL_DIV8                  ((uint32_t)0x0A000000)
#define  RCC_CFGR0_MCO_SERDES_DIV16                  ((uint32_t)0x0B000000)

#define  RCC_ADC_DUTY_SEL                            ((uint32_t)0x40000000)
#define  RCC_ADCSRC                                  ((uint32_t)0x80000000)

/*******************  Bit definition for RCC_PLLCFGR register  *******************/
#define  RCC_PLLMUL                                  ((uint32_t)0x0000001F)
#define  RCC_PLLMUL_0                                ((uint32_t)0x00000001)
#define  RCC_PLLMUL_1                                ((uint32_t)0x00000002)
#define  RCC_PLLMUL_2                                ((uint32_t)0x00000004)
#define  RCC_PLLMUL_3                                ((uint32_t)0x00000008)
#define  RCC_PLLMUL_4                                ((uint32_t)0x00000010)

#define  RCC_PLLMUL4                                 ((uint32_t)0x00000000)
#define  RCC_PLLMUL6                                 ((uint32_t)0x00000001)
#define  RCC_PLLMUL7                                 ((uint32_t)0x00000002)
#define  RCC_PLLMUL8                                 ((uint32_t)0x00000003)
#define  RCC_PLLMUL8_5                               ((uint32_t)0x00000004)
#define  RCC_PLLMUL9                                 ((uint32_t)0x00000005)
#define  RCC_PLLMUL9_5                               ((uint32_t)0x00000006)
#define  RCC_PLLMUL10                                ((uint32_t)0x00000007)
#define  RCC_PLLMUL10_5                              ((uint32_t)0x00000008)
#define  RCC_PLLMUL11                                ((uint32_t)0x00000009)
#define  RCC_PLLMUL11_5                              ((uint32_t)0x0000000A)
#define  RCC_PLLMUL12                                ((uint32_t)0x0000000B)
#define  RCC_PLLMUL12_5                              ((uint32_t)0x0000000C)
#define  RCC_PLLMUL13                                ((uint32_t)0x0000000D)
#define  RCC_PLLMUL14                                ((uint32_t)0x0000000E)
#define  RCC_PLLMUL15                                ((uint32_t)0x0000000F)
#define  RCC_PLLMUL16                                ((uint32_t)0x00000010)
#define  RCC_PLLMUL17                                ((uint32_t)0x00000011)
#define  RCC_PLLMUL18                                ((uint32_t)0x00000012)
#define  RCC_PLLMUL19                                ((uint32_t)0x00000013)
#define  RCC_PLLMUL20                                ((uint32_t)0x00000014)
#define  RCC_PLLMUL22                                ((uint32_t)0x00000015)
#define  RCC_PLLMUL24                                ((uint32_t)0x00000016)
#define  RCC_PLLMUL26                                ((uint32_t)0x00000017)
#define  RCC_PLLMUL28                                ((uint32_t)0x00000018)
#define  RCC_PLLMUL30                                ((uint32_t)0x00000019)
#define  RCC_PLLMUL32                                ((uint32_t)0x0000001A)
#define  RCC_PLLMUL34                                ((uint32_t)0x0000001B)
#define  RCC_PLLMUL36                                ((uint32_t)0x0000001C)
#define  RCC_PLLMUL38                                ((uint32_t)0x0000001D)
#define  RCC_PLLMUL40                                ((uint32_t)0x0000001E)
#define  RCC_PLLMUL59                                ((uint32_t)0x0000001F)

#define  RCC_PLLSRC                                  ((uint32_t)0x000000E0)
#define  RCC_PLLSRC_0                                ((uint32_t)0x00000020)
#define  RCC_PLLSRC_2                                ((uint32_t)0x00000040)
#define  RCC_PLLSRC_4                                ((uint32_t)0x00000080)

#define  RCC_PLLSRC_HSI                              ((uint32_t)0x00000000)
#define  RCC_PLLSRC_HSE                              ((uint32_t)0x00000020)
#define  RCC_PLLSRC_USBHS_PLL                        ((uint32_t)0x00000080)
#define  RCC_PLLSRC_ETH_PLL                          ((uint32_t)0x000000A0)
#define  RCC_PLLSRC_USBSS_PLL                        ((uint32_t)0x000000C0)
#define  RCC_PLLSRC_SERDES_PLL                       ((uint32_t)0x000000E0)

