kholia/hal_wch/ch32fun/ch32h41xhw.h
#define  RCC_USBHSPLL_IN_DIV1                        ((uint32_t)0x00000000)
#define  RCC_USBHSPLL_IN_DIV2                        ((uint32_t)0x00000100)
#define  RCC_USBHSPLL_IN_DIV3                        ((uint32_t)0x00000200)
#define  RCC_USBHSPLL_IN_DIV4                        ((uint32_t)0x00000300)
#define  RCC_USBHSPLL_IN_DIV5                        ((uint32_t)0x00000400)
#define  RCC_USBHSPLL_IN_DIV6                        ((uint32_t)0x00000500)
#define  RCC_USBHSPLL_IN_DIV7                        ((uint32_t)0x00000600)
#define  RCC_USBHSPLL_IN_DIV8                        ((uint32_t)0x00000700)
#define  RCC_USBHSPLL_IN_DIV9                        ((uint32_t)0x00000800)
#define  RCC_USBHSPLL_IN_DIV10                       ((uint32_t)0x00000900)
#define  RCC_USBHSPLL_IN_DIV11                       ((uint32_t)0x00000A00)
#define  RCC_USBHSPLL_IN_DIV12                       ((uint32_t)0x00000B00)
#define  RCC_USBHSPLL_IN_DIV13                       ((uint32_t)0x00000C00)
#define  RCC_USBHSPLL_IN_DIV14                       ((uint32_t)0x00000D00)
#define  RCC_USBHSPLL_IN_DIV15                       ((uint32_t)0x00000E00)
#define  RCC_USBHSPLL_IN_DIV16                       ((uint32_t)0x00000F00)
#define  RCC_USBHSPLL_IN_DIV17                       ((uint32_t)0x00001000)
#define  RCC_USBHSPLL_IN_DIV18                       ((uint32_t)0x00001100)
#define  RCC_USBHSPLL_IN_DIV19                       ((uint32_t)0x00001200)
#define  RCC_USBHSPLL_IN_DIV20                       ((uint32_t)0x00001300)
#define  RCC_USBHSPLL_IN_DIV21                       ((uint32_t)0x00001400)
#define  RCC_USBHSPLL_IN_DIV22                       ((uint32_t)0x00001500)
#define  RCC_USBHSPLL_IN_DIV23                       ((uint32_t)0x00001600)
#define  RCC_USBHSPLL_IN_DIV24                       ((uint32_t)0x00001700)
#define  RCC_USBHSPLL_IN_DIV25                       ((uint32_t)0x00001800)
#define  RCC_USBHSPLL_IN_DIV26                       ((uint32_t)0x00001900)
#define  RCC_USBHSPLL_IN_DIV27                       ((uint32_t)0x00001A00)
#define  RCC_USBHSPLL_IN_DIV28                       ((uint32_t)0x00001B00)
#define  RCC_USBHSPLL_IN_DIV29                       ((uint32_t)0x00001C00)
#define  RCC_USBHSPLL_IN_DIV30                       ((uint32_t)0x00001D00)
#define  RCC_USBHSPLL_IN_DIV31                       ((uint32_t)0x00001E00)
#define  RCC_USBHSPLL_IN_DIV32                       ((uint32_t)0x00001F00)

#define  RCC_SERDESPLL_MUL                           ((uint32_t)0x000F0000)
#define  RCC_SERDESPLL_MUL_0                         ((uint32_t)0x00010000)
#define  RCC_SERDESPLL_MUL_1                         ((uint32_t)0x00020000)
#define  RCC_SERDESPLL_MUL_2                         ((uint32_t)0x00040000)
#define  RCC_SERDESPLL_MUL_3                         ((uint32_t)0x00080000)

#define  RCC_SERDESPLL_MUL25                         ((uint32_t)0x00000000)
#define  RCC_SERDESPLL_MUL28                         ((uint32_t)0x00010000)
#define  RCC_SERDESPLL_MUL30                         ((uint32_t)0x00020000)
#define  RCC_SERDESPLL_MUL32                         ((uint32_t)0x00030000)
#define  RCC_SERDESPLL_MUL35                         ((uint32_t)0x00040000)
#define  RCC_SERDESPLL_MUL38                         ((uint32_t)0x00050000)
#define  RCC_SERDESPLL_MUL40                         ((uint32_t)0x00060000)
#define  RCC_SERDESPLL_MUL45                         ((uint32_t)0x00070000)
#define  RCC_SERDESPLL_MUL50                         ((uint32_t)0x00080000)
#define  RCC_SERDESPLL_MUL56                         ((uint32_t)0x00090000)
#define  RCC_SERDESPLL_MUL60                         ((uint32_t)0x000A0000)
#define  RCC_SERDESPLL_MUL64                         ((uint32_t)0x000B0000)
#define  RCC_SERDESPLL_MUL70                         ((uint32_t)0x000C0000)
#define  RCC_SERDESPLL_MUL76                         ((uint32_t)0x000D0000)
#define  RCC_SERDESPLL_MUL80                         ((uint32_t)0x000E0000)
#define  RCC_SERDESPLL_MUL90                         ((uint32_t)0x000F0000)

/******************************************************************************/
/*                                    RNG                                     */
/******************************************************************************/
/********************  Bit definition for RNG_CR register  *******************/
#define  RNG_CR_RNGEN                                ((uint32_t)0x00000004)
#define  RNG_CR_IE                                   ((uint32_t)0x00000008)

/********************  Bit definition for RNG_SR register  *******************/
#define  RNG_SR_DRDY                                 ((uint32_t)0x00000001)
#define  RNG_SR_CECS                                 ((uint32_t)0x00000002)
#define  RNG_SR_SECS                                 ((uint32_t)0x00000004)
#define  RNG_SR_CEIS                                 ((uint32_t)0x00000020)
#define  RNG_SR_SEIS                                 ((uint32_t)0x00000040)

/******************************************************************************/
/*                             Real-Time Clock                                */
/******************************************************************************/

/*******************  Bit definition for RTC_CTLRH register  ********************/
#define  RTC_CTLRH_SECIE                             ((uint8_t)0x01)               /* Second Interrupt Enable */
#define  RTC_CTLRH_ALRIE                             ((uint8_t)0x02)               /* Alarm Interrupt Enable */
#define  RTC_CTLRH_OWIE                              ((uint8_t)0x04)               /* OverfloW Interrupt Enable */

/*******************  Bit definition for RTC_CTLRL register  ********************/
#define  RTC_CTLRL_SECF                              ((uint8_t)0x01)               /* Second Flag */
#define  RTC_CTLRL_ALRF                              ((uint8_t)0x02)               /* Alarm Flag */
#define  RTC_CTLRL_OWF                               ((uint8_t)0x04)               /* OverfloW Flag */
#define  RTC_CTLRL_RSF                               ((uint8_t)0x08)               /* Registers Synchronized Flag */
#define  RTC_CTLRL_CNF                               ((uint8_t)0x10)               /* Configuration Flag */
#define  RTC_CTLRL_RTOFF                             ((uint8_t)0x20)               /* RTC operation OFF */

/*******************  Bit definition for RTC_PSCRH register  *******************/
#define  RTC_PSCH_PRL                                ((uint16_t)0x000F)            /* RTC Prescaler Reload Value High */

/*******************  Bit definition for RTC_PSCRL register  *******************/
#define  RTC_PSCL_PRL                                ((uint16_t)0xFFFF)            /* RTC Prescaler Reload Value Low */

/*******************  Bit definition for RTC_DIVH register  *******************/
#define  RTC_DIVH_RTC_DIV                            ((uint16_t)0x000F)            /* RTC Clock Divider High */

