kholia/hal_wch/ch32fun/ch32h41xhw.h
#define  USART_CTLR2_LINEN                           ((uint16_t)0x4000)            /* LIN mode enable */

/******************  Bit definition for USART_CTLR3 register  *******************/
#define  USART_CTLR3_EIE                             ((uint16_t)0x0001)            /* Error Interrupt Enable */
#define  USART_CTLR3_IREN                            ((uint16_t)0x0002)            /* IrDA mode Enable */
#define  USART_CTLR3_IRLP                            ((uint16_t)0x0004)            /* IrDA Low-Power */
#define  USART_CTLR3_HDSEL                           ((uint16_t)0x0008)            /* Half-Duplex Selection */
#define  USART_CTLR3_NACK                            ((uint16_t)0x0010)            /* Smartcard NACK enable */
#define  USART_CTLR3_SCEN                            ((uint16_t)0x0020)            /* Smartcard mode enable */
#define  USART_CTLR3_DMAR                            ((uint16_t)0x0040)            /* DMA Enable Receiver */
#define  USART_CTLR3_DMAT                            ((uint16_t)0x0080)            /* DMA Enable Transmitter */
#define  USART_CTLR3_RTSE                            ((uint16_t)0x0100)            /* RTS Enable */
#define  USART_CTLR3_CTSE                            ((uint16_t)0x0200)            /* CTS Enable */
#define  USART_CTLR3_CTSIE                           ((uint16_t)0x0400)            /* CTS Interrupt Enable */
#define  USART_CTLR3_LPWKUP_EN                       ((uint16_t)0x0800)
#define  USART_CTLR3_LPWKUP_CK_SRC                   ((uint16_t)0x1000)
#define  USART_CTLR3_LPWKUP_DLY_CFG                  ((uint16_t)0xE000)

/******************  Bit definition for USART_GPR register  ******************/
#define  USART_GPR_PSC                               ((uint16_t)0x00FF)            /* PSC[7:0] bits (Prescaler value) */
#define  USART_GPR_PSC_0                             ((uint16_t)0x0001)            /* Bit 0 */
#define  USART_GPR_PSC_1                             ((uint16_t)0x0002)            /* Bit 1 */
#define  USART_GPR_PSC_2                             ((uint16_t)0x0004)            /* Bit 2 */
#define  USART_GPR_PSC_3                             ((uint16_t)0x0008)            /* Bit 3 */
#define  USART_GPR_PSC_4                             ((uint16_t)0x0010)            /* Bit 4 */
#define  USART_GPR_PSC_5                             ((uint16_t)0x0020)            /* Bit 5 */
#define  USART_GPR_PSC_6                             ((uint16_t)0x0040)            /* Bit 6 */
#define  USART_GPR_PSC_7                             ((uint16_t)0x0080)            /* Bit 7 */

#define  USART_GPR_GT                                ((uint16_t)0xFF00)            /* Guard time value */

/******************  Bit definition for USART_CTLR4 register  ******************/
#define  USART_CTLR4_MS_ERRIE                        ((uint16_t)0x0002)
#define  USART_CTLR4_CHECK_SEL                       ((uint16_t)0x000C)
#define  USART_CTLR4_CHECK_MARKENABLE                ((uint16_t)0x0008)
#define  USART_CTLR4_CHECK_APACEENABLE               ((uint16_t)0x000C)

/******************************************************************************/
/*                            OPA                                 */
/******************************************************************************/

/*******************  Bit definition for OPA_CTLR1 register  ********************/
#define  OPA_CTLR1_EN1                               ((uint16_t)0x0001)

#define  OPA_CTLR1_MODE1                             ((uint16_t)0x0006)
#define  OPA_CTLR1_MODE1_0                           ((uint16_t)0x0002)
#define  OPA_CTLR1_MODE1_1                           ((uint16_t)0x0004)

#define  OPA_CTLR1_PSEL1                             ((uint16_t)0x0008)

#define  OPA_CTLR1_NSEL1                             ((uint16_t)0x0070)
#define  OPA_CTLR1_NSEL1_0                           ((uint16_t)0x0010)
#define  OPA_CTLR1_NSEL1_1                           ((uint16_t)0x0020)
#define  OPA_CTLR1_NSEL1_2                           ((uint16_t)0x0030)

#define  OPA_CTLR1_FBEN1                             ((uint16_t)0x0100)
#define  OPA_CTLR1_PGADIF1                           ((uint16_t)0x0200)
#define  OPA_CTLR1_HS1                               ((uint16_t)0x0400)

/*******************  Bit definition for OPA_CTLR2 register  ********************/
#define  OPA_CTLR2_EN2                               ((uint16_t)0x0001)

#define  OPA_CTLR2_MODE2                             ((uint16_t)0x0006)
#define  OPA_CTLR2_MODE2_0                           ((uint16_t)0x0002)
#define  OPA_CTLR2_MODE2_1                           ((uint16_t)0x0004)

#define  OPA_CTLR2_PSEL2                             ((uint16_t)0x0008)

#define  OPA_CTLR2_NSEL2                             ((uint16_t)0x0070)
#define  OPA_CTLR2_NSEL2_0                           ((uint16_t)0x0010)
#define  OPA_CTLR2_NSEL2_1                           ((uint16_t)0x0020)
#define  OPA_CTLR2_NSEL2_2                           ((uint16_t)0x0030)

#define  OPA_CTLR2_FBEN2                             ((uint16_t)0x0100)
#define  OPA_CTLR2_PGADIF2                           ((uint16_t)0x0200)
#define  OPA_CTLR2_HS2                               ((uint16_t)0x0400)

/*******************  Bit definition for OPA_CTLR3 register  ********************/
#define  OPA_CTLR3_EN3                               ((uint16_t)0x0001)

#define  OPA_CTLR3_MODE3                             ((uint16_t)0x0006)
#define  OPA_CTLR3_MODE3_0                           ((uint16_t)0x0002)
#define  OPA_CTLR3_MODE3_1                           ((uint16_t)0x0004)

#define  OPA_CTLR3_PSEL3                             ((uint16_t)0x0008)

#define  OPA_CTLR3_NSEL3                             ((uint16_t)0x0070)
#define  OPA_CTLR3_NSEL3_0                           ((uint16_t)0x0010)
#define  OPA_CTLR3_NSEL3_1                           ((uint16_t)0x0020)
#define  OPA_CTLR3_NSEL3_2                           ((uint16_t)0x0030)

#define  OPA_CTLR3_FBEN3                             ((uint16_t)0x0100)
#define  OPA_CTLR3_PGADIF3                           ((uint16_t)0x0200)
#define  OPA_CTLR3_HS3                               ((uint16_t)0x0400)

/*******************  Bit definition for CMP_CTLR register  ********************/
#define  OPA_CMP_CTLR_PSEL                           ((uint32_t)0x00000003)
#define  OPA_CMP_CTLR_PSEL_0                         ((uint32_t)0x00000001)
#define  OPA_CMP_CTLR_PSEL_1                         ((uint32_t)0x00000002)

