kholia/hal_wch/ch32fun/ch32h41xhw.h
/*******************  Bit definition for SDMMC_DMA_BEG2 register  *******************/
#define  SDMMC_DMAAD2_MASK                           ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for SDMMC_TUNE_DATO register  *******************/
#define  SDMMC_TUNNE_DAT0_O                          ((uint32_t)0x0000000F)
#define  SDMMC_TUNNE_DAT1_O                          ((uint32_t)0x000000F0)
#define  SDMMC_TUNNE_DAT2_O                          ((uint32_t)0x00000F00)
#define  SDMMC_TUNNE_DAT3_O                          ((uint32_t)0x0000F000)
#define  SDMMC_TUNNE_DAT4_O                          ((uint32_t)0x000F0000)
#define  SDMMC_TUNNE_DAT5_O                          ((uint32_t)0x00F00000)
#define  SDMMC_TUNNE_DAT6_O                          ((uint32_t)0x0F000000)
#define  SDMMC_TUNNE_DAT7_O                          ((uint32_t)0xF0000000)

/*******************  Bit definition for SDMMC_TUNE_DATI register  *******************/
#define  SDMMC_TUNNE_DAT0_I                          ((uint32_t)0x0000000F)
#define  SDMMC_TUNNE_DAT1_I                          ((uint32_t)0x000000F0)
#define  SDMMC_TUNNE_DAT2_I                          ((uint32_t)0x00000F00)
#define  SDMMC_TUNNE_DAT3_I                          ((uint32_t)0x0000F000)
#define  SDMMC_TUNNE_DAT4_I                          ((uint32_t)0x000F0000)
#define  SDMMC_TUNNE_DAT5_I                          ((uint32_t)0x00F00000)
#define  SDMMC_TUNNE_DAT6_I                          ((uint32_t)0x0F000000)
#define  SDMMC_TUNNE_DAT7_I                          ((uint32_t)0xF0000000)

/*******************  Bit definition for SDMMC_TUNE_CLK_CMD register  *******************/
#define  SDMMC_TUNNE_CLK_O                           ((uint32_t)0x0000000F)
#define  SDMMC_TUNNE_CLK_I                           ((uint32_t)0x000000F0)
#define  SDMMC_TUNNE_CMD_O                           ((uint32_t)0x000F0000)
#define  SDMMC_TUNNE_CMD_I                           ((uint32_t)0x00F00000)

/*******************  Bit definition for SDMMC_ARGUMENT register  *******************/
#define  EMMC_ARGUMENT                               SDMMC_ARGUMENT
/*******************  Bit definition for SDMMC_CMD_SET register  *******************/
#define  EMMC_CMDIDX_MASK                            SDMMC_CMDIDX_MASK
#define  EMMC_RPTY_MASK                              SDMMC_RPTY_MASK
#define  EMMC_CKCRC                                  SDMMC_CKCRC
#define  EMMC_CKIDX                                  SDMMC_CKIDX

/*******************  Bit definition for SDMMC_RESPONSE0 register  *******************/
#define  EMMC_RESPONSE0                              SDMMC_RESPONSE0

/*******************  Bit definition for SDMMC_RESPONSE1 register  *******************/
#define  EMMC_RESPONSE1                              SDMMC_RESPONSE1

/*******************  Bit definition for SDMMC_RESPONSE2 register  *******************/
#define  EMMC_RESPONSE2                              SDMMC_RESPONSE2

/*******************  Bit definition for SDMMC_RESPONSE3 register  *******************/
#define  EMMC_RESPONSE3                              SDMMC_RESPONSE3

/*******************  Bit definition for SDMMC_WRITE_CONT register  *******************/
#define  EMMC_WRITE_CONT                             SDMMC_WRITE_CONT

/*******************  Bit definition for SDMMC_CONTROL register  *******************/
#define  EMMC_LW_MASK                                SDMMC_LW_MASK
#define  EMMC_LW_MASK_0                              SDMMC_LW_MASK_0
#define  EMMC_LW_MASK_1                              SDMMC_LW_MASK_1

#define  EMMC_ALL_CLR                                SDMMC_ALL_CLR
#define  EMMC_DMAEN                                  SDMMC_DMAEN
#define  EMMC_RST_LGC                                SDMMC_RST_LGC
#define  EMMC_NEGSMP                                 SDMMC_NEGSMP
#define  EMMC_SLV_MODE                               SDMMC_SLV_MODE
#define  EMMC_SLV_FORCE_ERR                          SDMMC_SLV_FORCE_ERR

/*******************  Bit definition for SDMMC_TIMEOUT register  *******************/
#define  EMMC_TOCNT_MASK                             SDMMC_TOCNT_MASK

/*******************  Bit definition for SDMMC_STATUS register  *******************/
#define  EMMC_MASK_BLOCK_NUM                         SDMMC_MASK_BLOCK_NUM
#define  EMMC_CMDSTA                                 SDMMC_CMDSTA
#define  EMMC_DAT0STA                                SDMMC_DAT0STA

/*******************  Bit definition for SDMMC_INT_FG register  *******************/
#define  EMMC_IF_RE_TMOUT                            SDMMC_IF_RE_TMOUT
#define  EMMC_IF_RECRC_WR                            SDMMC_IF_RECRC_WR
#define  EMMC_IF_REIDX_ER                            SDMMC_IF_REIDX_ER
#define  EMMC_IF_CMDDONE                             SDMMC_IF_CMDDONE
#define  EMMC_IF_DATTMO                              SDMMC_IF_DATTMO
#define  EMMC_IF_TRANERR                             SDMMC_IF_TRANERR
#define  EMMC_IF_TRANDONE                            SDMMC_IF_TRANDONE
#define  EMMC_IF_BKGAP                               SDMMC_IF_BKGAP
#define  EMMC_IF_FIFO_OV                             SDMMC_IF_FIFO_OV
#define  EMMC_IF_SDIOINT                             SDMMC_IF_SDIOINT
#define  EMMC_SIF_SLV_BUF_RELEAS                     SDMMC_SIF_SLV_BUF_RELEAS

/*******************  Bit definition for SDMMC_INT_EN register  *******************/
#define  EMMC_IE_RE_TMOUT                            SDMMC_IE_RE_TMOUT
#define  EMMC_IE_RECRC_WR                            SDMMC_IE_RECRC_WR
#define  EMMC_IE_REIDX_ER                            SDMMC_IE_REIDX_ER
#define  EMMC_IE_CMDDONE                             SDMMC_IE_CMDDONE
#define  EMMC_IE_DATTMO                              SDMMC_IE_DATTMO
#define  EMMC_IE_TRANERR                             SDMMC_IE_TRANERR
#define  EMMC_IE_TRANDONE                            SDMMC_IE_TRANDONE
#define  EMMC_IE_FIFO_OV                             SDMMC_IE_FIFO_OV
#define  EMMC_IE_SDIOINT                             SDMMC_IE_SDIOINT

/*******************  Bit definition for SDMMC_DMA_BEG1 register  *******************/
#define  EMMC_DMAAD1_MASK                            SDMMC_DMAAD1_MASK

/*******************  Bit definition for SDMMC_BLOCK_CFG register  *******************/
#define  EMMC_BKNUM_MASK                             SDMMC_BKNUM_MASK
#define  EMMC_BKSIZE_MASK                            SDMMC_BKSIZE_MASK

/*******************  Bit definition for SDMMC_TRAN_MODE register  *******************/
#define  EMMC_DMA_DIR                                SDMMC_DMA_DIR
#define  EMMC_GAP_STOP                               SDMMC_GAP_STOP
#define  EMMC_MODE_BOOT                              SDMMC_MODE_BOOT
#define  EMMC_AUTOGAPSTOP                            SDMMC_AUTOGAPSTOP

#define  EMMC_DMATN_CNT                              SDMMC_DMATN_CNT

#define  EMMC_DULEDMA_EN                             SDMMC_DULEDMA_EN
#define  EMMC_DDR_MODE                               SDMMC_DDR_MODE
#define  EMMC_CARE_NEG                               SDMMC_CARE_NEG

#define  EMMC_SW                                     SDMMC_SW
#define  EMMC_SW_0                                   SDMMC_SW_0
#define  EMMC_SW_1                                   SDMMC_SW_1

