kholia/hal_wch/ch32fun/ch32h41xhw.h
/*********************  Bit definition for SERDES_INT_FG register  *********************/
#define  SDS_PHYRDY_IF                               ((uint32_t)0x00000001)
#define  SDS_RECV_ERR_IF                             ((uint32_t)0x00000002)
#define  SDS_TRAN_DONE_IF                            ((uint32_t)0x00000002)
#define  SDS_RECV_DONE_IF                            ((uint32_t)0x00000004)
#define  SDS_FIFO_OV_IF                              ((uint32_t)0x00000008)
#define  SDS_COMINIT_IF                              ((uint32_t)0x00000020)
#define  SDS_PHYRDY                                  ((uint32_t)0x00010000)
#define  SDS_RX_SEQ_MATCH                            ((uint32_t)0x00020000)
#define  SDS_RECV_CRC_OK                             ((uint32_t)0x00040000)
#define  SDS_PLL_LOCK                                ((uint32_t)0x00080000)
#define  SDS_LINK_FREE                               ((uint32_t)0x00100000)
#define  SDS_R_FIFO_RDY                              ((uint32_t)0x00200000)
#define  SDS_RX_SEQ_NUM                              ((uint32_t)0x0F000000)
#define  SDS_TX_SEQ_NUM                              ((uint32_t)0xF0000000)

/*********************  Bit definition for SERDES_RTX_CTRL register  *********************/
#define  SDS_SERDES_TX_LEN                           ((uint32_t)0x0000FFFF)
#define  SDS_LINK_INIT                               ((uint32_t)0x00010000)
#define  SDS_TX_VLD                                  ((uint32_t)0x00020000)
#define  SDS_BUF_MODE                                ((uint32_t)0x00040000)

/*********************  Bit definition for SERDES_RX_LEN0 register  *********************/
#define  SDS_SERDES_RX_LEN0                          ((uint32_t)0x0000FFFF)

/*********************  Bit definition for SERDES_DATA0 register  *********************/
#define  SDS_SERDES_DATA0                            ((uint32_t)0xFFFFFFFF)

/*********************  Bit definition for SERDES_DMA0 register  *********************/
#define  SDS_SERDES_DMA0                             ((uint32_t)0xFFFFFFFF)

/*********************  Bit definition for SERDES_RX_LEN1 register  *********************/
#define  SDS_SERDES_RX_LEN1                          ((uint32_t)0x0000FFFF)

/*********************  Bit definition for SERDES_DATA1 register  *********************/
#define  SDS_SERDES_DATA1                            ((uint32_t)0xFFFFFFFF)

/*********************  Bit definition for SERDES_DMA1 register  *********************/
#define  SDS_SERDES_DMA1                             ((uint32_t)0xFFFFFFFF)


/******************************************************************************/
/*                                 SWPMI                                      */
/******************************************************************************/
/*******************  Bit definition for SWPMI_CR register  *******************/
#define  SWPMI_RXDMA                                 ((uint32_t)0x00000001)
#define  SWPMI_TXDMA                                 ((uint32_t)0x00000002)
#define  SWPMI_RXMODE                                ((uint32_t)0x00000004)
#define  SWPMI_TXMODE                                ((uint32_t)0x00000008)
#define  SWPMI_LPBK                                  ((uint32_t)0x00000010)
#define  SWPMI_SWPACT                                ((uint32_t)0x00000020)
#define  SWPMI_DEACT                                 ((uint32_t)0x00000400)
#define  SWPMI_SWPTEN                                ((uint32_t)0x00000800)

/*******************  Bit definition for SWPMI_BRR register  *******************/
#define  SWPMI_BR                                    ((uint32_t)0x000000FF)

/*******************  Bit definition for SWPMI_ISR register  *******************/
#define  SWPMI_RXBFF                                 ((uint32_t)0x00000001)
#define  SWPMI_TXBEF                                 ((uint32_t)0x00000002)
#define  SWPMI_RXBERF                                ((uint32_t)0x00000004)
#define  SWPMI_RXOVRF                                ((uint32_t)0x00000008)
#define  SWPMI_TXUNRF                                ((uint32_t)0x00000010)
#define  SWPMI_RXNE                                  ((uint32_t)0x00000020)
#define  SWPMI_TXE                                   ((uint32_t)0x00000040)
#define  SWPMI_TCF                                   ((uint32_t)0x00000080)
#define  SWPMI_SRF                                   ((uint32_t)0x00000100)
#define  SWPMI_SUSP                                  ((uint32_t)0x00000200)
#define  SWPMI_DEACTF                                ((uint32_t)0x00000400)
#define  SWPMI_RDYF                                  ((uint32_t)0x00000800)

/*******************  Bit definition for SWPMI_ICR register  *******************/
#define  SWPMI_CRXBFF                                ((uint32_t)0x00000001)
#define  SWPMI_CTXBEF                                ((uint32_t)0x00000002)
#define  SWPMI_CRXBERF                               ((uint32_t)0x00000004)
#define  SWPMI_CRXOVRF                               ((uint32_t)0x00000008)
#define  SWPMI_CTXUNRF                               ((uint32_t)0x00000010)
#define  SWPMI_CTCF                                  ((uint32_t)0x00000080)
#define  SWPMI_CSRF                                  ((uint32_t)0x00000100)
#define  SWPMI_CRDYF                                 ((uint32_t)0x00000800)

/*******************  Bit definition for SWPMI_IER register  *******************/
#define  SWPMI_RXBFIE                                ((uint32_t)0x00000001)
#define  SWPMI_TXBEIE                                ((uint32_t)0x00000002)
#define  SWPMI_RXBERIE                               ((uint32_t)0x00000004)
#define  SWPMI_RXOVRIE                               ((uint32_t)0x00000008)
#define  SWPMI_TXUNRIE                               ((uint32_t)0x00000010)
#define  SWPMI_RIE                                   ((uint32_t)0x00000020)
#define  SWPMI_TIE                                   ((uint32_t)0x00000040)
#define  SWPMI_TCIE                                  ((uint32_t)0x00000080)
#define  SWPMI_SRIE                                  ((uint32_t)0x00000100)
#define  SWPMI_RDYIE                                 ((uint32_t)0x00000800)

/*******************  Bit definition for SWPMI_RFL register  *******************/
#define  SWPMI_RFL                                   ((uint32_t)0x0000001F)

/*******************  Bit definition for SWPMI_TDR register  *******************/
#define  SWPMI_TD                                    ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for SWPMI_OR register  *******************/
#define  SWPMI_SWP_TBYP                              ((uint32_t)0x00000001)

#define  SWPMI_SWP_ISEL                              ((uint32_t)0x0000000C)
#define  SWPMI_SWP_ISEL_0                            ((uint32_t)0x00000004)
#define  SWPMI_SWP_ISEL_1                            ((uint32_t)0x00000008)

/******************************************************************************/
/*                                 FMC                                      */
/******************************************************************************/
/*******************  Bit definition for FMC_BCR1 register  *******************/
#define  FMC_BCR1_MBKEN                              ((uint32_t)0x00000001)
#define  FMC_BCR1_MUXEN                              ((uint32_t)0x00000002)

