kholia/hal_wch/ch32fun/ch32h41xhw.h
#define  DFSDM_FLTISR_SCDF                           ((uint32_t)0x03000000)
#define  DFSDM_FLTISR_SCDF_0                         ((uint32_t)0x01000000)
#define  DFSDM_FLTISR_SCDF_1                         ((uint32_t)0x02000000)

/*******************  Bit definition for DFSDM_FLTICR register  *******************/
#define  DFSDM_FLTICR_CLRJOVRF                       ((uint32_t)0x00000004)
#define  DFSDM_FLTICR_CLRROVRF                       ((uint32_t)0x00000008)

#define  DFSDM_FLTICR_CLRCKABF                       ((uint32_t)0x00030000)
#define  DFSDM_FLTICR_CLRCKABF_0                     ((uint32_t)0x00010000)
#define  DFSDM_FLTICR_CLRCKABF_1                     ((uint32_t)0x00020000)

#define  DFSDM_FLTICR_CLRSCDF                        ((uint32_t)0x03000000)
#define  DFSDM_FLTICR_CLRSCDF_0                      ((uint32_t)0x01000000)
#define  DFSDM_FLTICR_CLRSCDF_1                      ((uint32_t)0x02000000)

/*******************  Bit definition for DFSDM_FLTJCHGR register  *******************/
#define  DFSDM_FLTJCHGR_JCHG                         ((uint32_t)0x00000003)

/*******************  Bit definition for DFSDM_FLTFCR3 register  *******************/
#define  DFSDM_FLTFCR3_IOSR                          ((uint32_t)0x000000FF)
#define  DFSDM_FLTFCR3_IOSR_0                        ((uint32_t)0x00000001)
#define  DFSDM_FLTFCR3_IOSR_1                        ((uint32_t)0x00000002)
#define  DFSDM_FLTFCR3_IOSR_2                        ((uint32_t)0x00000004)
#define  DFSDM_FLTFCR3_IOSR_3                        ((uint32_t)0x00000008)
#define  DFSDM_FLTFCR3_IOSR_4                        ((uint32_t)0x00000010)
#define  DFSDM_FLTFCR3_IOSR_5                        ((uint32_t)0x00000020)
#define  DFSDM_FLTFCR3_IOSR_6                        ((uint32_t)0x00000040)
#define  DFSDM_FLTFCR3_IOSR_7                        ((uint32_t)0x00000080)


#define  DFSDM_FLTFCR3_FOSR                          ((uint32_t)0x03FF0000)
#define  DFSDM_FLTFCR3_FOSR_0                        ((uint32_t)0x00010000)
#define  DFSDM_FLTFCR3_FOSR_1                        ((uint32_t)0x00020000)
#define  DFSDM_FLTFCR3_FOSR_2                        ((uint32_t)0x00040000)
#define  DFSDM_FLTFCR3_FOSR_3                        ((uint32_t)0x00080000)
#define  DFSDM_FLTFCR3_FOSR_4                        ((uint32_t)0x00100000)
#define  DFSDM_FLTFCR3_FOSR_5                        ((uint32_t)0x00200000)
#define  DFSDM_FLTFCR3_FOSR_6                        ((uint32_t)0x00400000)
#define  DFSDM_FLTFCR3_FOSR_7                        ((uint32_t)0x00800000)
#define  DFSDM_FLTFCR3_FOSR_8                        ((uint32_t)0x01000000)
#define  DFSDM_FLTFCR3_FOSR_9                        ((uint32_t)0x03FF0000)

#define  DFSDM_FLTFCR3_FORD                          ((uint32_t)0xE0000000)
#define  DFSDM_FLTFCR3_FORD_0                        ((uint32_t)0x20000000)
#define  DFSDM_FLTFCR3_FORD_1                        ((uint32_t)0x40000000)
#define  DFSDM_FLTFCR3_FORD_2                        ((uint32_t)0x80000000)

/*******************  Bit definition for DFSDM_FLTJDATAR register  *******************/
#define  DFSDM_FLTJDATAR_JDATACH                     ((uint32_t)0x00000001)
#define  DFSDM_FLTJDATAR_JDATA                       ((uint32_t)0xFFFFFF00)

/*******************  Bit definition for DFSDM_FLTRDATAR register  *******************/
#define  DFSDM_FLTRDATAR_RDATACH                     ((uint32_t)0x00000001)
#define  DFSDM_FLTRDATAR_RPEND                       ((uint32_t)0x00000010)
#define  DFSDM_FLTRDATAR_RDATA                       ((uint32_t)0xFFFFFF00)

/*******************  Bit definition for DFSDM_FLTAWHTR register  *******************/
#define  DFSDM_FLTAWHTR_BKAWH                        ((uint32_t)0x0000000F)
#define  DFSDM_FLTAWHTR_BKAWH_0                      ((uint32_t)0x00000001)
#define  DFSDM_FLTAWHTR_BKAWH_1                      ((uint32_t)0x00000002)
#define  DFSDM_FLTAWHTR_BKAWH_2                      ((uint32_t)0x00000004)
#define  DFSDM_FLTAWHTR_BKAWH_3                      ((uint32_t)0x00000008)

#define  DFSDM_FLTAWHTR_AWHT                         ((uint32_t)0xFFFFFF00)

/*******************  Bit definition for DFSDM_FLTAWLTR register  *******************/
#define  DFSDM_FLTAWLTR_BKAWL                        ((uint32_t)0x0000000F)
#define  DFSDM_FLTAWLTR_BKAWL_0                      ((uint32_t)0x00000001)
#define  DFSDM_FLTAWLTR_BKAWL_1                      ((uint32_t)0x00000002)
#define  DFSDM_FLTAWLTR_BKAWL_2                      ((uint32_t)0x00000004)
#define  DFSDM_FLTAWLTR_BKAWL_3                      ((uint32_t)0x00000008)

#define  DFSDM_FLTAWLTR_AWLT                         ((uint32_t)0xFFFFFF00)

/*******************  Bit definition for DFSDM_FLTAWSR register  *******************/
#define  DFSDM_FLTAWSR_AWLTF                         ((uint32_t)0x00000003)
#define  DFSDM_FLTAWSR_AWHTF                         ((uint32_t)0x00000300)

/*******************  Bit definition for DFSDM_FLTAWCFR register  *******************/
#define  DFSDM_FLTAWCFR_CLRAWLTF                     ((uint32_t)0x00000003)
#define  DFSDM_FLTAWCFR_CLRAWLTF_0                   ((uint32_t)0x00000001)
#define  DFSDM_FLTAWCFR_CLRAWLTF_1                   ((uint32_t)0x00000002)

#define  DFSDM_FLTAWCFR_CLRAWHTF                     ((uint32_t)0x00000300)
#define  DFSDM_FLTAWCFR_CLRAWHTF_0                   ((uint32_t)0x00000100)
#define  DFSDM_FLTAWCFR_CLRAWHTF_1                   ((uint32_t)0x00000200)

/*******************  Bit definition for DFSDM_FLTEXMAX register  *******************/
#define  DFSDM_FLTEXMAX_EXMAXCH                      ((uint32_t)0x00000001)
#define  DFSDM_FLTEXMAX_EXMAX                        ((uint32_t)0xFFFFFF00)

/*******************  Bit definition for DFSDM_FLTEXMIN register  *******************/
#define  DFSDM_FLTEXMIN_EXMINCH                      ((uint32_t)0x00000001)
#define  DFSDM_FLTEXMIN_EXMIN                        ((uint32_t)0xFFFFFF00)

/*******************  Bit definition for DFSDM_FLTCNVTIMR register  *******************/
#define  DFSDM_FLTCNVTIMR_CNVCNT                     ((uint32_t)0xFFFFFF00)

/******************************************************************************/
/*                                 LTDC                                      */
/******************************************************************************/
/*******************  Bit definition for LTDC_SSCR register  *******************/
#define  LTDC_SSCR_VSH                               ((uint32_t)0x000007FF)
#define  LTDC_SSCR_HSW                               ((uint32_t)0x0FFF0000)

/*******************  Bit definition for LTDC_BPCR register  *******************/
#define  LTDC_BPCR_AVBP                              ((uint32_t)0x000007FF)
#define  LTDC_BPCR_AHBP                              ((uint32_t)0x0FFF0000)

/*******************  Bit definition for LTDC_AWCR register  *******************/
#define  LTDC_AWCR_AAH                               ((uint32_t)0x000007FF)
#define  LTDC_AWCR_AAW                               ((uint32_t)0x0FFF0000)

