kholia/hal_wch/ch32fun/ch32h41xhw.h
/*******************  Bit definition for LTDC_TWCR register  *******************/
#define  LTDC_TWCR_TOTALH                            ((uint32_t)0x000007FF)
#define  LTDC_TWCR_TOTALW                            ((uint32_t)0x0FFF0000)

/*******************  Bit definition for LTDC_GCR register  *******************/
#define  LTDC_GCR_LTDCEN                             ((uint32_t)0x00000001)

#define  LTDC_GCR_DBW                                ((uint32_t)0x00000070)
#define  LTDC_GCR_DBW_0                              ((uint32_t)0x00000010)
#define  LTDC_GCR_DBW_1                              ((uint32_t)0x00000020)
#define  LTDC_GCR_DBW_2                              ((uint32_t)0x00000040)

#define  LTDC_GCR_DGW                                ((uint32_t)0x00000700)
#define  LTDC_GCR_DGW_0                              ((uint32_t)0x00000100)
#define  LTDC_GCR_DGW_1                              ((uint32_t)0x00000200)
#define  LTDC_GCR_DGW_2                              ((uint32_t)0x00000400)

#define  LTDC_GCR_DRW                                ((uint32_t)0x00007000)
#define  LTDC_GCR_DRW_0                              ((uint32_t)0x00001000)
#define  LTDC_GCR_DRW_1                              ((uint32_t)0x00002000)
#define  LTDC_GCR_DRW_2                              ((uint32_t)0x00004000)

#define  LTDC_GCR_DEN                                ((uint32_t)0x00010000)

#define  LTDC_GCR_PCPOL                              ((uint32_t)0x10000000)
#define  LTDC_GCR_DEPOL                              ((uint32_t)0x20000000)
#define  LTDC_GCR_VSPOL                              ((uint32_t)0x40000000)
#define  LTDC_GCR_HSPOL                              ((uint32_t)0x80000000)

/*******************  Bit definition for LTDC_SRCR register  *******************/
#define  LTDC_SRCR_IMR                               ((uint32_t)0x00000001)
#define  LTDC_SRCR_VBR                               ((uint32_t)0x00000002)

/*******************  Bit definition for LTDC_BCCR register  *******************/
#define  LTDC_BCCR_BCBLUE                            ((uint32_t)0x000000FF)
#define  LTDC_BCCR_BCGREEN                           ((uint32_t)0x0000FF00)
#define  LTDC_BCCR_BCRED                             ((uint32_t)0x00FF0000)

/*******************  Bit definition for LTDC_IER register  *******************/
#define  LTDC_IER_LIE                                ((uint32_t)0x00000001)
#define  LTDC_IER_FUIE                               ((uint32_t)0x00000002)

#define  LTDC_IER_RRIE                               ((uint32_t)0x00000008)

/*******************  Bit definition for LTDC_ISR register  *******************/
#define  LTDC_ISR_LIF                                ((uint32_t)0x00000001)
#define  LTDC_ISR_FUIF                               ((uint32_t)0x00000002)

#define  LTDC_ISR_RRIF                               ((uint32_t)0x00000008)

/*******************  Bit definition for LTDC_ICR register  *******************/
#define  LTDC_ICR_CLIF                               ((uint32_t)0x00000001)
#define  LTDC_ICR_CFUIF                              ((uint32_t)0x00000002)

#define  LTDC_ICR_CRRIF                              ((uint32_t)0x00000008)

/*******************  Bit definition for LTDC_LIPCR register  *******************/
#define  LTDC_LIPCR_LIPOS                            ((uint32_t)0x000007FF)

/*******************  Bit definition for LTDC_CPSR register  *******************/
#define  LTDC_CPSR_CYPOS                             ((uint32_t)0x0000FFFF)
#define  LTDC_CPSR_CXPOS                             ((uint32_t)0xFFFF0000)

/*******************  Bit definition for LTDC_CDSR register  *******************/
#define  LTDC_CDSR_VDES                              ((uint32_t)0x00000001)
#define  LTDC_CDSR_HDES                              ((uint32_t)0x00000002)
#define  LTDC_CDSR_VSYNCS                            ((uint32_t)0x00000004)
#define  LTDC_CDSR_HSYNCS                            ((uint32_t)0x00000008)

/*******************  Bit definition for LTDC_CR register  *******************/
#define  LTDC_CR_LEN                                 ((uint32_t)0x00000001)
#define  LTDC_CR_COLKEN                              ((uint32_t)0x00000002)

#define  LTDC_CR_CLUTEN                              ((uint32_t)0x00000010)

/*******************  Bit definition for LTDC_WHPCR register  *******************/
#define  LTDC_WHPCR_WHSTPOS                          ((uint32_t)0x00000FFF)
#define  LTDC_WHPCR_WHSPPOS                          ((uint32_t)0x0FFF0000)

/*******************  Bit definition for LTDC_WVPCR register  *******************/
#define  LTDC_WVPCR_WVSTPOS                          ((uint32_t)0x000007FF)
#define  LTDC_WVPCR_WVSPPOS                          ((uint32_t)0x07FF0000)

/*******************  Bit definition for LTDC_CKCR register  *******************/
#define  LTDC_CKCR_CKBLUE                            ((uint32_t)0x000000FF)
#define  LTDC_CKCR_CKGREEN                           ((uint32_t)0x0000FF00)
#define  LTDC_CKCR_CKRED                             ((uint32_t)0x00FF0000)

/*******************  Bit definition for LTDC_PFCR register  *******************/
#define  LTDC_PFCR_PF                                ((uint32_t)0x00000007)
#define  LTDC_PFCR_PF_0                              ((uint32_t)0x00000001)
#define  LTDC_PFCR_PF_1                              ((uint32_t)0x00000002)
#define  LTDC_PFCR_PF_2                              ((uint32_t)0x00000004)

#define  LTDC_PFCR_PF_ARGB8888                       ((uint32_t)0x00000000)
#define  LTDC_PFCR_PF_RGB888                         ((uint32_t)0x00000001)
#define  LTDC_PFCR_PF_RGB565                         ((uint32_t)0x00000002)
#define  LTDC_PFCR_PF_ARGB1555                       ((uint32_t)0x00000003)
#define  LTDC_PFCR_PF_ARGB4444                       ((uint32_t)0x00000004)
#define  LTDC_PFCR_PF_L8                             ((uint32_t)0x00000005)
#define  LTDC_PFCR_PF_AL44                           ((uint32_t)0x00000006)
#define  LTDC_PFCR_PF_AL88                           ((uint32_t)0x00000007)

/*******************  Bit definition for LTDC_CACR register  *******************/
#define  LTDC_CACR_CONSTA                            ((uint32_t)0x000000FF)

