kholia/hal_wch/ch32fun/ch32h41xhw.h
#define  GPHA_FGPFCCR_ALPHA                          ((uint32_t)0xFF000000)

/*******************  Bit definition for GPHA_FGCOLR register  *******************/
#define  GPHA_FGCOLR_BLUE                            ((uint32_t)0x000000FF)
#define  GPHA_FGCOLR_GREEN                           ((uint32_t)0x0000FF00)
#define  GPHA_FGCOLR_RED                             ((uint32_t)0x00FF0000)

/*******************  Bit definition for GPHA_BGPFCCR register  *******************/
#define  GPHA_BGPFCCR_CM                             ((uint32_t)0x0000000F)
#define  GPHA_BGPFCCR_CM_0                           ((uint32_t)0x00000001)
#define  GPHA_BGPFCCR_CM_1                           ((uint32_t)0x00000002)
#define  GPHA_BGPFCCR_CM_2                           ((uint32_t)0x00000004)
#define  GPHA_BGPFCCR_CM_3                           ((uint32_t)0x00000008)

#define  GPHA_BGPFCCR_CM_ARGB8888                    ((uint32_t)0x00000000)
#define  GPHA_BGPFCCR_CM_RGB888                      ((uint32_t)0x00000001)
#define  GPHA_BGPFCCR_CM_RGB565                      ((uint32_t)0x00000002)
#define  GPHA_BGPFCCR_CM_ARGB1555                    ((uint32_t)0x00000003)
#define  GPHA_BGPFCCR_CM_ARGB4444                    ((uint32_t)0x00000004)
#define  GPHA_BGPFCCR_CM_L8                          ((uint32_t)0x00000005)
#define  GPHA_BGPFCCR_CM_AL44                        ((uint32_t)0x00000006)
#define  GPHA_BGPFCCR_CM_AL88                        ((uint32_t)0x00000007)
#define  GPHA_BGPFCCR_CM_L4                          ((uint32_t)0x00000008)
#define  GPHA_BGPFCCR_CM_A8                          ((uint32_t)0x00000009)
#define  GPHA_BGPFCCR_CM_A4                          ((uint32_t)0x0000000A)

#define  GPHA_BGPFCCR_CCM                            ((uint32_t)0x00000010)
#define  GPHA_BGPFCCR_START                          ((uint32_t)0x00000020)

#define  GPHA_BGPFCCR_CS                             ((uint32_t)0x0000FF00)

#define  GPHA_BGPFCCR_AM                             ((uint32_t)0x00030000)
#define  GPHA_BGPFCCR_AM_0                           ((uint32_t)0x00010000)
#define  GPHA_BGPFCCR_AM_1                           ((uint32_t)0x00020000)

#define  GPHA_BGPFCCR_AI                             ((uint32_t)0x00100000)
#define  GPHA_BGPFCCR_RBS                            ((uint32_t)0x00200000)

#define  GPHA_BGPFCCR_ALPHA                          ((uint32_t)0xFF000000)

/*******************  Bit definition for GPHA_BGCOLR register  *******************/
#define  GPHA_BGCOLR_BLUE                            ((uint32_t)0x000000FF)
#define  GPHA_BGCOLR_GREEN                           ((uint32_t)0x0000FF00)
#define  GPHA_BGCOLR_RED                             ((uint32_t)0x00FF0000)

/*******************  Bit definition for GPHA_FGCMAR register  *******************/
#define  GPHA_FGCMAR_MA                              ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for GPHA_BGCMAR register  *******************/
#define  GPHA_BGCMAR_MA                              ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for GPHA_OPFCCR register  *******************/
#define  GPHA_OPFCCR_CM                              ((uint32_t)0x00000007)
#define  GPHA_OPFCCR_CM_0                            ((uint32_t)0x00000001)
#define  GPHA_OPFCCR_CM_1                            ((uint32_t)0x00000002)
#define  GPHA_OPFCCR_CM_2                            ((uint32_t)0x00000004)

#define  GPHA_OPFCCR_CM_ARGB8888                     ((uint32_t)0x00000000)
#define  GPHA_OPFCCR_CM_RGB888                       ((uint32_t)0x00000001)
#define  GPHA_OPFCCR_CM_RGB565                       ((uint32_t)0x00000002)
#define  GPHA_OPFCCR_CM_ARGB1555                     ((uint32_t)0x00000003)
#define  GPHA_OPFCCR_CM_ARGB4444                     ((uint32_t)0x00000004)

#define  GPHA_OPFCCR_AI                              ((uint32_t)0x00100000)
#define  GPHA_OPFCCR_RBS                             ((uint32_t)0x00200000)

/*******************  Bit definition for GPHA_OCOLR register  *******************/
#define  GPHA_OCOLR_BLUE                             ((uint32_t)0x000000FF)
#define  GPHA_OCOLR_GREEN                            ((uint32_t)0x0000FF00)
#define  GPHA_OCOLR_RED                              ((uint32_t)0x00FF0000)
#define  GPHA_OCOLR_ALPHA                            ((uint32_t)0xFF000000)

/*******************  Bit definition for GPHA_OMAR register  *******************/
#define  GPHA_OMAR_MA                                ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for GPHA_OOR register  *******************/
#define  GPHA_OOR_LO                                 ((uint32_t)0x00003FFF)

/*******************  Bit definition for GPHA_NLR register  *******************/
#define  GPHA_NLR_NL                                 ((uint32_t)0x0000FFFF)
#define  GPHA_NLR_PL                                 ((uint32_t)0x3FFF0000)

/*******************  Bit definition for GPHA_LWR register  *******************/
#define  GPHA_LWR_LW                                 ((uint32_t)0x0000FFFF)

/*******************  Bit definition for GPHA_AMTCR register  *******************/
#define  GPHA_AMTCR_EN                               ((uint32_t)0x00000001)
#define  GPHA_AMTCR_DT                               ((uint32_t)0x0000FF00)

/*******************  Bit definition for GPHA_FGCWRS register  *******************/
#define  GPHA_FGCWRS_FG_CLUT_INDEX                   ((uint32_t)0x000000FF)
#define  GPHA_FGCWRS_FG_CLUT_EN                      ((uint32_t)0x00000100)

/*******************  Bit definition for GPHA_FGCDAT register  *******************/
#define  GPHA_FGCDAT_FG_CLUT_DATA                    ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for GPHA_BGCWRS register  *******************/
#define  GPHA_BGCWRS_BG_CLUT_INDEX                   ((uint32_t)0x000000FF)
#define  GPHA_BGCWRS_BG_CLUT_EN                      ((uint32_t)0x00000100)

/*******************  Bit definition for GPHA_BGCDAT register  *******************/
#define  GPHA_BGCDAT_BG_CLUT_DATA                    ((uint32_t)0xFFFFFFFF)

/******************************************************************************/
/*                                 QSPI                                      */
/******************************************************************************/
/*******************  Bit definition for QSPI_CR register  *******************/
#define  QSPI_CR_EN                                  ((uint32_t)0x00000001)
#define  QSPI_CR_ABORT                               ((uint32_t)0x00000002)
#define  QSPI_CR_DMAEN                               ((uint32_t)0x00000004)
#define  QSPI_CR_TCEN                                ((uint32_t)0x00000008)

#define  QSPI_CR_START                               ((uint32_t)0x00000020)
#define  QSPI_CR_DFM                                 ((uint32_t)0x00000040)
#define  QSPI_CR_FSEL                                ((uint32_t)0x00000080)

#define  QSPI_CR_FTHRES                              ((uint32_t)0x00001F00)
#define  QSPI_CR_FTHRES_0                            ((uint32_t)0x00000100)
#define  QSPI_CR_FTHRES_1                            ((uint32_t)0x00000200)
#define  QSPI_CR_FTHRES_2                            ((uint32_t)0x00000400)
#define  QSPI_CR_FTHRES_3                            ((uint32_t)0x00000800)
#define  QSPI_CR_FTHRES_4                            ((uint32_t)0x00001000)

