kholia/hal_wch/ch32fun/ch32h41xhw.h
#define  QSPI_CR_TEIE                                ((uint32_t)0x00010000)
#define  QSPI_CR_TCIE                                ((uint32_t)0x00020000)
#define  QSPI_CR_FTIE                                ((uint32_t)0x00040000)
#define  QSPI_CR_SMIE                                ((uint32_t)0x00080000)
#define  QSPI_CR_TOIE                                ((uint32_t)0x00100000)
#define  QSPI_CR_APMS                                ((uint32_t)0x00400000)
#define  QSPI_CR_PMM                                 ((uint32_t)0x00800000)

#define  QSPI_CR_PRESCALER                           ((uint32_t)0xFF000000)
#define  QSPI_CR_PRESCALER_0                         ((uint32_t)0x01000000)
#define  QSPI_CR_PRESCALER_1                         ((uint32_t)0x02000000)
#define  QSPI_CR_PRESCALER_2                         ((uint32_t)0x04000000)
#define  QSPI_CR_PRESCALER_3                         ((uint32_t)0x08000000)
#define  QSPI_CR_PRESCALER_4                         ((uint32_t)0x10000000)
#define  QSPI_CR_PRESCALER_5                         ((uint32_t)0x20000000)
#define  QSPI_CR_PRESCALER_6                         ((uint32_t)0x40000000)
#define  QSPI_CR_PRESCALER_7                         ((uint32_t)0x80000000)

/*******************  Bit definition for QSPI_DCR register  *******************/
#define  QSPI_DCR_CKMODE                             ((uint32_t)0x00000001)

#define  QSPI_DCR_CSHT                               ((uint32_t)0x00000700)
#define  QSPI_DCR_CSHT_0                             ((uint32_t)0x00000100)
#define  QSPI_DCR_CSHT_1                             ((uint32_t)0x00000200)
#define  QSPI_DCR_CSHT_2                             ((uint32_t)0x00000400)

#define  QSPI_DCR_FSIZE                              ((uint32_t)0x001F0000)
#define  QSPI_DCR_FSIZE_0                            ((uint32_t)0x00010000)
#define  QSPI_DCR_FSIZE_1                            ((uint32_t)0x00020000)
#define  QSPI_DCR_FSIZE_2                            ((uint32_t)0x00040000)
#define  QSPI_DCR_FSIZE_3                            ((uint32_t)0x00080000)
#define  QSPI_DCR_FSIZE_4                            ((uint32_t)0x00100000)

/*******************  Bit definition for QSPI_SR register  *******************/
#define  QSPI_SR_TEF                                 ((uint32_t)0x00000001)
#define  QSPI_SR_TCF                                 ((uint32_t)0x00000002)
#define  QSPI_SR_FTF                                 ((uint32_t)0x00000004)
#define  QSPI_SR_SMF                                 ((uint32_t)0x00000008)
#define  QSPI_SR_TOF                                 ((uint32_t)0x00000010)
#define  QSPI_SR_BUSY                                ((uint32_t)0x00000020)

#define  QSPI_SR_FLEVEL                              ((uint32_t)0x00003F00)
#define  QSPI_SR_FLEVEL_0                            ((uint32_t)0x00000100)
#define  QSPI_SR_FLEVEL_1                            ((uint32_t)0x00000200)
#define  QSPI_SR_FLEVEL_2                            ((uint32_t)0x00000400)
#define  QSPI_SR_FLEVEL_3                            ((uint32_t)0x00000800)
#define  QSPI_SR_FLEVEL_4                            ((uint32_t)0x00001000)
#define  QSPI_SR_FLEVEL_5                            ((uint32_t)0x00002000)

#define  QSPI_SR_IDLEF                               ((uint32_t)0x00010000)

/*******************  Bit definition for QSPI_FCR register  *******************/
#define  QSPI_FCR_CTEF                               ((uint32_t)0x00000001)
#define  QSPI_FCR_CTCF                               ((uint32_t)0x00000002)
#define  QSPI_FCR_CSMF                               ((uint32_t)0x00000008)
#define  QSPI_FCR_CTOF                               ((uint32_t)0x00000010)

/*******************  Bit definition for QSPI_DLR register  *******************/
#define  QSPI_DLR_DL                                 ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for QSPI_CCR register  *******************/
#define  QSPI_CCR_INSTRUCTION                        ((uint32_t)0x000000FF)
#define  QSPI_CCR_INSTRUCTION_0                      ((uint32_t)0x00000001)
#define  QSPI_CCR_INSTRUCTION_1                      ((uint32_t)0x00000002)
#define  QSPI_CCR_INSTRUCTION_2                      ((uint32_t)0x00000004)
#define  QSPI_CCR_INSTRUCTION_3                      ((uint32_t)0x00000008)
#define  QSPI_CCR_INSTRUCTION_4                      ((uint32_t)0x00000010)
#define  QSPI_CCR_INSTRUCTION_5                      ((uint32_t)0x00000020)
#define  QSPI_CCR_INSTRUCTION_6                      ((uint32_t)0x00000040)
#define  QSPI_CCR_INSTRUCTION_7                      ((uint32_t)0x00000080)

#define  QSPI_CCR_IMODE                              ((uint32_t)0x00000300)
#define  QSPI_CCR_IMODE_0                            ((uint32_t)0x00000100)
#define  QSPI_CCR_IMODE_1                            ((uint32_t)0x00000200)

#define  QSPI_CCR_ADMODE                             ((uint32_t)0x00000C00)
#define  QSPI_CCR_ADMODE_0                           ((uint32_t)0x00000400)
#define  QSPI_CCR_ADMODE_1                           ((uint32_t)0x00000800)

#define  QSPI_CCR_ADSIZE                             ((uint32_t)0x00003000)
#define  QSPI_CCR_ADSIZE_0                           ((uint32_t)0x00001000)
#define  QSPI_CCR_ADSIZE_1                           ((uint32_t)0x00002000)

#define  QSPI_CCR_ABMODE                             ((uint32_t)0x0000C000)
#define  QSPI_CCR_ABMODE_0                           ((uint32_t)0x00004000)
#define  QSPI_CCR_ABMODE_1                           ((uint32_t)0x00008000)

#define  QSPI_CCR_ABSIZE                             ((uint32_t)0x00030000)
#define  QSPI_CCR_ABSIZE_0                           ((uint32_t)0x00010000)
#define  QSPI_CCR_ABSIZE_1                           ((uint32_t)0x00020000)

#define  QSPI_CCR_DCYC                               ((uint32_t)0x007C0000)
#define  QSPI_CCR_DCYC_0                             ((uint32_t)0x00040000)
#define  QSPI_CCR_DCYC_1                             ((uint32_t)0x00080000)
#define  QSPI_CCR_DCYC_2                             ((uint32_t)0x00100000)
#define  QSPI_CCR_DCYC_3                             ((uint32_t)0x00200000)
#define  QSPI_CCR_DCYC_4                             ((uint32_t)0x00400000)

#define  QSPI_CCR_DMODE                              ((uint32_t)0x03000000)
#define  QSPI_CCR_DMODE_0                            ((uint32_t)0x01000000)
#define  QSPI_CCR_DMODE_1                            ((uint32_t)0x02000000)

#define  QSPI_CCR_FMODE                              ((uint32_t)0x0C000000)
#define  QSPI_CCR_FMODE_0                            ((uint32_t)0x04000000)
#define  QSPI_CCR_FMODE_1                            ((uint32_t)0x08000000)

