kholia/hal_wch/ch32fun/ch32h41xhw.h
/* ch32h417_opa.h ------------------------------------------------------------*/

#ifndef __ASSEMBLER__

/* OPA member enumeration */
typedef enum
{
   OPA1 = 0,
   OPA2,
   OPA3,
}OPA_Num_TypeDef;

/* OPA PSEL enumeration */
typedef enum
{
		CHP0 = 0,
		CHP1
} OPA_PSEL_TypeDef;

/* OPA NSEL enumeration */
typedef enum
{
   CHN0 = 0,
   CHN1,
   CHN_PGA_8xIN,
   CHN_PGA_16xIN,
   CHN_PGA_32xIN,
   CHN_PGA_64xIN,
   CHN_OFF = 0x7
}OPA_NSEL_TypeDef;

/* OPA out channel enumeration */
typedef enum
{
   OUT_IO_OUT0 = 0,
   OUT_IO_OUT1,
   OUT_TO_CMP /* only for OPA1 */
}OPA_Mode_TypeDef;


/* OPA_FB_enumeration */
typedef enum
{
    FB_OFF = 0,
    FB_ON
} OPA_FB_TypeDef;

/* OPA_HS_enumeration */
typedef enum
{
    HS_OFF = 0,
    HS_ON
} OPA_HS_TypeDef;

/* OPA_PFG_DIF_enumeration */
typedef enum
{
    DIF_OFF = 0,
    DIF_ON
} OPA_PGADIF_TypeDef;

/* OPA Init Structure definition */
typedef struct
{
  OPA_PSEL_TypeDef PSEL;         /* Specifies the positive channel of OPA */
  OPA_NSEL_TypeDef NSEL;         /* Specifies the negative channel of OPA */
  OPA_Mode_TypeDef Mode;         /* Specifies the mode of OPA */
  OPA_FB_TypeDef FB;             /* Specifies the internal feedback resistor of OPA */
  OPA_PGADIF_TypeDef PGADIF;     /* Specifies the internal PGADIF of OPA */
  OPA_HS_TypeDef HS;             /* specifies high speed mode enable of OPA */
}OPA_InitTypeDef;

/* CMP_out_channel_enumeration */
typedef enum
{
    OUT_TO_IO = 0,
    OUT_TIM1_BKIN,
    OUT_TIM8_BKIN,
    OUT_TIM1_CH4,
    OUT_TIM2_CH4,
    OUT_TIM3_CH4,
    OUT_TIM4_CH4,
    OUT_TIM5_CH4,
    OUT_TIM8_CH4,
    OUT_TIM9_CH4,
    OUT_TIM10_CH4,
    OUT_TIM11_CH4,
    OUT_TIM12_CH4,
    OUT_LPTIM1_CH1,
    OUT_LPTIM2_CH1,
    OUT_FLOAT
} CMP_Mode_TypeDef;

/* CMP_NSEL_enumeration */
typedef enum
{
    CMP_CHN0 = 0,
    CMP_CHN1,
    CMP_DAC2,
    CMP_VREF,
} CMP_NSEL_TypeDef;

/* CMP_PSEL_enumeration */
typedef enum
{
    CMP_CHP_0 = 0,
    CMP_CHP_1,
    CMP_OPA1
} CMP_PSEL_TypeDef;

#define  CMP_CHP1 CMP_CHP_0
#define  CMP_CHP2 CMP_CHP_1

/* CMP_VREF_enumeration */
typedef enum
{
    CMP_VREF_OFF = 0,
    CMP_VREF_25PER_VDD,
    CMP_VREF_50PERT_VDD,
    CMP_VREF_75PERC_VDD
} CMP_VREF_TypeDef;

/* CMP_HYPSEL_enumeration */
typedef enum
{
    CMP_HYPSEL_OFF = 0,
    CMP_HYPSEL_10mV,
    CMP_HYPSEL_20mV,
    CMP_HYPSEL_30mV,
} CMP_HYPSEL_TypeDef;

/* CMP Init structure definition */
typedef struct
{
    CMP_Mode_TypeDef   Mode;     /* Specifies the mode of CMP */
    CMP_NSEL_TypeDef   NSEL;     /* Specifies the negative channel of CMP */
    CMP_PSEL_TypeDef   PSEL;     /* Specifies the positive channel of CMP */
    CMP_VREF_TypeDef   VREF;     /* Specifies the positive VREF of CMP */
    CMP_HYPSEL_TypeDef HYPSEL;     /* Specifies the HYEN of CMP */
} CMP_InitTypeDef;

/* CMP FILT_TimeBase division definition */
#define CMP_FILT_TimeBase_Div1   ((uint8_t)0x00)
#define CMP_FILT_TimeBase_Div2   ((uint8_t)0x01)
#define CMP_FILT_TimeBase_Div3   ((uint8_t)0x02)
#define CMP_FILT_TimeBase_Div4   ((uint8_t)0x03)

#endif

/* ch32h417_pwr.h ------------------------------------------------------------*/

/* PVD_detection_level  */
#define PWR_PVDLevel_MODE0          ((uint32_t)0x00000000)
#define PWR_PVDLevel_MODE1          ((uint32_t)0x00000020)
#define PWR_PVDLevel_MODE2          ((uint32_t)0x00000040)
#define PWR_PVDLevel_MODE3          ((uint32_t)0x00000060)
#define PWR_PVDLevel_MODE4          ((uint32_t)0x00000080)
#define PWR_PVDLevel_MODE5          ((uint32_t)0x000000A0)
#define PWR_PVDLevel_MODE6          ((uint32_t)0x000000C0)
#define PWR_PVDLevel_MODE7          ((uint32_t)0x000000E0)

/* PWR_detection_level  */
#define PWR_VIO18Level_MODE0        ((uint32_t)0x00000000)
#define PWR_VIO18Level_MODE1        ((uint32_t)0x00000400)
#define PWR_VIO18Level_MODE2        ((uint32_t)0x00000800)
#define PWR_VIO18Level_MODE3        ((uint32_t)0x00000C00)
#define PWR_VIO18Level_MODE4        ((uint32_t)0x00001000)
#define PWR_VIO18Level_MODE5        ((uint32_t)0x00001400)

/* Regulator_state_is_STOP_mode */
#define PWR_Regulator_ON            ((uint32_t)0x00000000)
#define PWR_Regulator_LowPower      ((uint32_t)0x00000001)

/* STOP_mode_entry */
#define PWR_STOPEntry_WFI           ((uint8_t)0x01)
#define PWR_STOPEntry_WFE           ((uint8_t)0x02)

/* PWR_Flag */
#define PWR_FLAG_PVDO               ((uint32_t)0x00000001)

/* PWR_VIO18CFGMODE */
#define PWR_VIO18CFGMODE_HW         ((uint32_t)0x00000000)
#define PWR_VIO18CFGMODE_SW         ((uint32_t)0x00000200)


/* ch32h417_rcc.h ------------------------------------------------------------*/

/* HSE_configuration */
#define RCC_HSE_OFF                      ((uint32_t)0x00000000)
#define RCC_HSE_ON                       ((uint32_t)0x00010000)
#define RCC_HSE_Bypass                   ((uint32_t)0x00040000)

/* PLL_entry_clock_source */
#define RCC_PLLSource_HSI                ((uint32_t)0x00000000)
#define RCC_PLLSource_HSE                ((uint32_t)0x00000020)
#define RCC_PLLSource_USBHS              ((uint32_t)0x00000080)
#define RCC_PLLSource_ETH                ((uint32_t)0x000000A0)
#define RCC_PLLSource_USBSS              ((uint32_t)0x000000C0)
#define RCC_PLLSource_SERDES             ((uint32_t)0x000000E0)

/* PLL_multiplication_factor */
#define RCC_PLLMul_4                     ((uint32_t)0x00000000)
#define RCC_PLLMul_6                     ((uint32_t)0x00000001)
#define RCC_PLLMul_7                     ((uint32_t)0x00000002)
#define RCC_PLLMul_8                     ((uint32_t)0x00000003)
#define RCC_PLLMul_8_5                   ((uint32_t)0x00000004)
#define RCC_PLLMul_9                     ((uint32_t)0x00000005)
#define RCC_PLLMul_9_5                   ((uint32_t)0x00000006)
#define RCC_PLLMul_10                    ((uint32_t)0x00000007)
#define RCC_PLLMul_10_5                  ((uint32_t)0x00000008)
#define RCC_PLLMul_11                    ((uint32_t)0x00000009)
#define RCC_PLLMul_11_5                  ((uint32_t)0x0000000A)
#define RCC_PLLMul_12                    ((uint32_t)0x0000000B)
#define RCC_PLLMul_12_5                  ((uint32_t)0x0000000C)
#define RCC_PLLMul_13                    ((uint32_t)0x0000000D)
#define RCC_PLLMul_14                    ((uint32_t)0x0000000E)
#define RCC_PLLMul_15                    ((uint32_t)0x0000000F)
#define RCC_PLLMul_16                    ((uint32_t)0x00000010)
#define RCC_PLLMul_17                    ((uint32_t)0x00000011)
#define RCC_PLLMul_18                    ((uint32_t)0x00000012)
#define RCC_PLLMul_19                    ((uint32_t)0x00000013)
#define RCC_PLLMul_20                    ((uint32_t)0x00000014)
#define RCC_PLLMul_22                    ((uint32_t)0x00000015)
#define RCC_PLLMul_24                    ((uint32_t)0x00000016)
#define RCC_PLLMul_26                    ((uint32_t)0x00000017)
#define RCC_PLLMul_28                    ((uint32_t)0x00000018)
#define RCC_PLLMul_30                    ((uint32_t)0x00000019)
#define RCC_PLLMul_32                    ((uint32_t)0x0000001A)
#define RCC_PLLMul_34                    ((uint32_t)0x0000001B)
#define RCC_PLLMul_36                    ((uint32_t)0x0000001C)
#define RCC_PLLMul_38                    ((uint32_t)0x0000001D)
#define RCC_PLLMul_40                    ((uint32_t)0x0000001E)
#define RCC_PLLMul_59                    ((uint32_t)0x0000001F)

