kholia/hal_wch/ch32fun/ch32h41xhw.h
/* I3C_CONTROL_FIFO_STATE */
#define I3C_CONTROLFIFO_DISABLE              ((uint32_t)0x00000000)
#define I3C_CONTROLFIFO_ENABLE               I3C_CFGR_TMODE

/* I3C_STATUS_FIFO_STATE */
#define I3C_STATUSFIFO_DISABLE               ((uint32_t)0x00000000)
#define I3C_STATUSFIFO_ENABLE                I3C_CFGR_SMODE

/* I3C_flags_definition */
#define I3C_FLAG_CFEF                        ((uint32_t)0x00000001)
#define I3C_FLAG_TXFEF                       ((uint32_t)0x00000002)
#define I3C_FLAG_CFNFF                       ((uint32_t)0x00000004)
#define I3C_FLAG_SFNEF                       ((uint32_t)0x00000008)
#define I3C_FLAG_TXFNFF                      ((uint32_t)0x00000010)
#define I3C_FLAG_RXFNEF                      ((uint32_t)0x00000020)
#define I3C_FLAG_TXLASTF                     ((uint32_t)0x00000040)
#define I3C_FLAG_RXLASTF                     ((uint32_t)0x00000080)
#define I3C_FLAG_FCF                         ((uint32_t)0x00000200)
#define I3C_FLAG_RXTGTENDF                   ((uint32_t)0x00000400)
#define I3C_FLAG_ERRF                        ((uint32_t)0x00000800)
#define I3C_FLAG_IBIF                        ((uint32_t)0x00008000)
#define I3C_FLAG_IBIENDF                     ((uint32_t)0x00010000)
#define I3C_FLAG_CRF                         ((uint32_t)0x00020000)
#define I3C_FLAG_CRUPDF                      ((uint32_t)0x00040000)
#define I3C_FLAG_HJF                         ((uint32_t)0x00080000)
#define I3C_FLAG_WKPF                        ((uint32_t)0x00200000)
#define I3C_FLAG_GETF                        ((uint32_t)0x00400000)
#define I3C_FLAG_STAF                        ((uint32_t)0x00800000)
#define I3C_FLAG_DAUPDF                      ((uint32_t)0x01000000)
#define I3C_FLAG_MWLUPDF                     ((uint32_t)0x02000000)
#define I3C_FLAG_MRLUPDF                     ((uint32_t)0x04000000)
#define I3C_FLAG_RSTF                        ((uint32_t)0x08000000)
#define I3C_FLAG_ASUPDF                      ((uint32_t)0x10000000)
#define I3C_FLAG_INTUPDF                     ((uint32_t)0x20000000)
#define I3C_FLAG_DEFF                        ((uint32_t)0x40000000)
#define I3C_FLAG_GRPF                        ((uint32_t)0x80000000)

/* I3C_interrupts_definition */
#define I3C_IT_CFNFIE                        ((uint32_t)0x00000004)
#define I3C_IT_SFNEIE                        ((uint32_t)0x00000008)
#define I3C_IT_TXFNEIE                       ((uint32_t)0x00000010)
#define I3C_IT_RXFNEIE                       ((uint32_t)0x00000020)
#define I3C_IT_FCIE                          ((uint32_t)0x00000200)
#define I3C_IT_RXTGTENDIE                    ((uint32_t)0x00000400)
#define I3C_IT_ERRIE                         ((uint32_t)0x00000800)
#define I3C_IT_IBIIE                         ((uint32_t)0x00008000)
#define I3C_IT_IBIENDIE                      ((uint32_t)0x00010000)
#define I3C_IT_CRIE                          ((uint32_t)0x00020000)
#define I3C_IT_HJIE                          ((uint32_t)0x00080000)
#define I3C_IT_CRUPDIE                       ((uint32_t)0x00040000)
#define I3C_IT_WKPIE                         ((uint32_t)0x00200000)
#define I3C_IT_GETIE                         ((uint32_t)0x00400000)
#define I3C_IT_STAIE                         ((uint32_t)0x00800000)
#define I3C_IT_DAUPDIE                       ((uint32_t)0x01000000)
#define I3C_IT_MWLUPDIE                      ((uint32_t)0x02000000)
#define I3C_IT_MRLUPDIE                      ((uint32_t)0x04000000)
#define I3C_IT_RSTIE                         ((uint32_t)0x08000000)
#define I3C_IT_ASUPDIE                       ((uint32_t)0x10000000)
#define I3C_IT_INTUPDIE                      ((uint32_t)0x20000000)
#define I3C_IT_DEFIE                         ((uint32_t)0x40000000)
#define I3C_IT_GRPIE                         ((uint32_t)0x80000000)

/* I3C_ERROR */
#define I3C_ERROR_CE0                        ((uint32_t)0x00000000)
#define I3C_ERROR_CE1                        ((uint32_t)0x00000001)
#define I3C_ERROR_CE2                        ((uint32_t)0x00000002)
#define I3C_ERROR_CE3                        ((uint32_t)0x00000003)
#define I3C_ERROR_TE0                        ((uint32_t)0x00000008)
#define I3C_ERROR_TE1                        ((uint32_t)0x00000009)
#define I3C_ERROR_TE2                        ((uint32_t)0x0000000A)
#define I3C_ERROR_TE3                        ((uint32_t)0x0000000B)
#define I3C_ERROR_TE4                        ((uint32_t)0x0000000C)
#define I3C_ERROR_TE5                        ((uint32_t)0x0000000D)
#define I3C_ERROR_TE6                        ((uint32_t)0x0000000E)
#define I3C_ERROR_PERR                       ((uint32_t)0x00000010)
#define I3C_ERROR_STALL                      ((uint32_t)0x00000020)
#define I3C_ERROR_DOVR                       ((uint32_t)0x00000040)
#define I3C_ERROR_COVR                       ((uint32_t)0x00000080)
#define I3C_ERROR_ADDRESS_NACK               ((uint32_t)0x00000100)
#define I3C_ERROR_DATA_NACK                  ((uint32_t)0x00000200)
#define I3C_ERROR_DATA_HAND_OFF              ((uint32_t)0x00000400)

/* ch32h417_lptim.h -----------------------------------------------------------*/

/* LPTIM_Clock_Source */
#define LPTIM_ClockSource_In                      ((uint32_t)0x00000000)
#define LPTIM_ClockSource_Ex                      ((uint32_t)0x00000001)

/* LPTIM_ClockPolarity */
#define LPTIM_ClockPolarity_Rising                ((uint32_t)0x00000000)
#define LPTIM_ClockPolarity_Falling               ((uint32_t)0x00000002)
#define LPTIM_ClockPolarity_Rising_Falling        ((uint32_t)0x00000004)

/* LPTIM_ClockPrescalerTime */
#define LPTIM_ClockSampleTime_0T                  ((uint32_t)0x00000000)
#define LPTIM_ClockSampleTime_2T                  ((uint32_t)0x00000008)
#define LPTIM_ClockSampleTime_4T                  ((uint32_t)0x00000010)
#define LPTIM_ClockSampleTime_8T                  ((uint32_t)0x00000018)

/* LPTIM_TriggerSampleTime */
#define LPTIM_TriggerSampleTime_0T                ((uint32_t)0x00000000)
#define LPTIM_TriggerSampleTime_2T                ((uint32_t)0x00000040)
#define LPTIM_TriggerSampleTime_4T                ((uint32_t)0x00000080)
#define LPTIM_TriggerSampleTime_8T                ((uint32_t)0x000000C0)

/* LPTIM_ClockPrescaler */
#define LPTIM_TClockPrescaler_DIV1                ((uint32_t)0x00000000)
#define LPTIM_TClockPrescaler_DIV2                ((uint32_t)0x00000200)
#define LPTIM_TClockPrescaler_DIV4                ((uint32_t)0x00000400)
#define LPTIM_TClockPrescaler_DIV8                ((uint32_t)0x00000600)
#define LPTIM_TClockPrescaler_DIV16               ((uint32_t)0x00000800)
#define LPTIM_TClockPrescaler_DIV32               ((uint32_t)0x00000A00)
#define LPTIM_TClockPrescaler_DIV64               ((uint32_t)0x00000C00)
#define LPTIM_TClockPrescaler_DIV128              ((uint32_t)0x00000E00)

/* LPTIM_TriggerSource */
#define LPTIM_TriggerSource_ETR                   ((uint32_t)0x00000000)
#define LPTIM_TriggerSource_RTC_ALARM             ((uint32_t)0x00002000)
#define LPTIM_TriggerSource_TAMP                  ((uint32_t)0x00004000)

/* LPTIM_ExTriggerPolarity */
#define LPTIM_ExTriggerPolarity_Disable           ((uint32_t)0x00000000)
#define LPTIM_ExTriggerPolarity_Rising            ((uint32_t)0x00020000)
#define LPTIM_ExTriggerPolarity_Falling           ((uint32_t)0x00040000)
#define LPTIM_ExTriggerPolarity_Rising_Falling    ((uint32_t)0x00060000)

/* LPTIM_OutputPolarity */
#define LPTIM_OutputPolarity_High                 ((uint32_t)0x00000000)
#define LPTIM_OutputPolarity_Low                  ((uint32_t)0x00200000)

/* LPTIM_UpdateMode */
#define LPTIM_UpdateMode0                         ((uint32_t)0x00000000)
#define LPTIM_UpdateMode1                         ((uint32_t)0x00400000)

/* LPTIM_CountSource */
#define LPTIM_CountSource_Internal                ((uint32_t)0x00000000)
#define LPTIM_CountSource_External                ((uint32_t)0x00800000)

