kholia/hal_wch/ch32fun/ch32h41xhw.h
/* LPTIM_InClockSource */
#define LPTIM_InClockSource_PCLK1                 ((uint32_t)0x00000000)
#define LPTIM_InClockSource_HSI                   ((uint32_t)0x02000000)
#define LPTIM_InClockSource_LSE                   ((uint32_t)0x04000000)
#define LPTIM_InClockSource_LSI                   ((uint32_t)0x06000000)

/* LPTIM_Flag_Definition */
#define LPTIM_FLAG_DIR_SYNC                       ((uint32_t)0x00000080)
#define LPTIM_FLAG_DOWN                           ((uint32_t)0x00000040)
#define LPTIM_FLAG_UP                             ((uint32_t)0x00000020)
#define LPTIM_FLAG_ARROK                          ((uint32_t)0x00000010)
#define LPTIM_FLAG_CMPOK                          ((uint32_t)0x00000008)
#define LPTIM_FLAG_EXTTRIG                        ((uint32_t)0x00000004)
#define LPTIM_FLAG_ARRM                           ((uint32_t)0x00000002)
#define LPTIM_FLAG_CMPM                           ((uint32_t)0x00000001)

/* LPTIM_Interrupts_Definition */
#define LPTIM_IT_DOWN                             ((uint32_t)0x00000040)
#define LPTIM_IT_UP                               ((uint32_t)0x00000020)
#define LPTIM_IT_ARROK                            ((uint32_t)0x00000010)
#define LPTIM_IT_CMPOK                            ((uint32_t)0x00000008)
#define LPTIM_IT_EXTTRIG                          ((uint32_t)0x00000004)
#define LPTIM_IT_ARRM                             ((uint32_t)0x00000002)
#define LPTIM_IT_CMPM                             ((uint32_t)0x00000001)

/* ch32h417_ltdc.h -----------------------------------------------------------*/

/* LTDC_HSPolarity */
#define LTDC_HSPolarity_AL         ((uint32_t)0x00000000)
#define LTDC_HSPolarity_AH         LTDC_GCR_HSPOL

/* LTDC_VSPolarity */
#define LTDC_VSPolarity_AL         ((uint32_t)0x00000000)
#define LTDC_VSPolarity_AH         LTDC_GCR_VSPOL

/* LTDC_DEPolarity */
#define LTDC_DEPolarity_AL         ((uint32_t)0x00000000)
#define LTDC_DEPolarity_AH         LTDC_GCR_DEPOL

/* LTDC_PCPolarity */
#define LTDC_PCPolarity_IPC        ((uint32_t)0x00000000)
#define LTDC_PCPolarity_IIPC       LTDC_GCR_PCPOL

/* LTDC_Reload */
#define LTDC_IMReload              LTDC_SRCR_IMR
#define LTDC_VBReload              LTDC_SRCR_VBR


/* LTDC_Position */
#define LTDC_POS_CY                LTDC_CPSR_CYPOS
#define LTDC_POS_CX                LTDC_CPSR_CXPOS


/* LTDC_CurrentStatus */
#define LTDC_CD_VDES               LTDC_CDSR_VDES
#define LTDC_CD_HDES               LTDC_CDSR_HDES
#define LTDC_CD_VSYNC              LTDC_CDSR_VSYNCS
#define LTDC_CD_HSYNC              LTDC_CDSR_HSYNCS

/* LTDC_Interrupts_definition */
#define LTDC_IT_LI                 LTDC_IER_LIE
#define LTDC_IT_FU                 LTDC_IER_FUIE
#define LTDC_IT_RR                 LTDC_IER_RRIE

/* LTDC_Flag_definition */
#define LTDC_FLAG_LI               LTDC_ISR_LIF
#define LTDC_FLAG_FU               LTDC_ISR_FUIF
#define LTDC_FLAG_RR               LTDC_ISR_RRIF

/* LTDC_Pixelformat */
#define LTDC_Pixelformat_ARGB8888  ((uint32_t)0x00000000)
#define LTDC_Pixelformat_RGB888    ((uint32_t)0x00000001)
#define LTDC_Pixelformat_RGB565    ((uint32_t)0x00000002)
#define LTDC_Pixelformat_ARGB1555  ((uint32_t)0x00000003)
#define LTDC_Pixelformat_ARGB4444  ((uint32_t)0x00000004)
#define LTDC_Pixelformat_L8        ((uint32_t)0x00000005)
#define LTDC_Pixelformat_AL44      ((uint32_t)0x00000006)
#define LTDC_Pixelformat_AL88      ((uint32_t)0x00000007)

/* LTDC_BlendingFactor1 */
#define LTDC_BlendingFactor1_CA    ((uint32_t)0x00000400)
#define LTDC_BlendingFactor1_PAxCA ((uint32_t)0x00000600)

/* LTDC_BlendingFactor2 */
#define LTDC_BlendingFactor2_CA    ((uint32_t)0x00000005)
#define LTDC_BlendingFactor2_PAxCA ((uint32_t)0x00000007)

/* ch32h417_pioc.h -----------------------------------------------------------*/

// Register Bit Attribute / Bit Access Type
//   RO:    Read Only (internal change)
//   RW:    Read / Write
// Attribute: master/PIOC

/* Register name rule:
   R32_* for 32 bits register (UINT32,ULONG)
   R16_* for 16 bits register (UINT16,USHORT)
   R8_*  for  8 bits register (UINT8,UCHAR)
   RB_*  for bit or bit mask of 8 bit register */

/* ********************************************************************************************************************* */

#define PIOC_SRAM_BASE      (0x50040000)        // PIOC code RAM base address

#define PIOC_SFR_BASE       PIOC_BASE                 // PIOC SFR base address

#define R32_PIOC_SFR        (*((volatile unsigned long *)(PIOC_SFR_BASE+0x04))) // RO/RW, PIOC SFR

#define R8_INDIR_ADDR       (*((volatile unsigned char *)(PIOC_SFR_BASE+0x04))) // RO/RW, PIOC indirect address

#define R8_TMR0_COUNT       (*((volatile unsigned char *)(PIOC_SFR_BASE+0x05))) // RO/RW, PIOC timer count

#define R8_TMR0_CTRL        (*((volatile unsigned char *)(PIOC_SFR_BASE+0x06))) // RO/RW, PIOC timer control and GP bit
#define  RB_EN_LEVEL1       0x80                      // RO/RW, enable IO1 level change to wakeup & action interrupt flag
#define  RB_EN_LEVEL0       0x40                      // RO/RW, enable IO0 level change to wakeup & action interrupt flag
#define  RB_GP_BIT_Y        0x20                      // RO/RW, general-purpose bit 1, reset by power on, no effect if system reset or RB_MST_RESET reset
#define  RB_GP_BIT_X        0x10                      // RO/RW, general-purpose bit 0, reset by power on, no effect if system reset or RB_MST_RESET reset
#define  RB_TMR0_MODE       0x08                      // RO/RW, timer mode: 0-timer, 1-PWM
#define  RB_TMR0_FREQ2      0x04                      // RO/RW, timer clock frequency selection 2
#define  RB_TMR0_FREQ1      0x02                      // RO/RW, timer clock frequency selection 1
#define  RB_TMR0_FREQ0      0x01                      // RO/RW, timer clock frequency selection 0

#define R8_TMR0_INIT        (*((volatile unsigned char *)(PIOC_SFR_BASE+0x07))) // RO/RW, PIOC timer initial value


#define R32_PORT_CFG        (*((volatile unsigned long *)(PIOC_SFR_BASE+0x08))) // RO/RW, port status and config

#define R8_BIT_CYCLE        (*((volatile unsigned char *)(PIOC_SFR_BASE+0x08))) // RO/RW, encode bit cycle
#define  RB_BIT_TX_O0       0x80                      // RO/RW, bit data for IO0 port encode output
#define  RB_BIT_CYCLE       0x7F                      // RO/RW, IO0 port bit data cycle -1

#define R8_INDIR_ADDR2      (*((volatile unsigned char *)(PIOC_SFR_BASE+0x09))) // RO/RW, PIOC indirect address 2

#define R8_PORT_DIR         (*((volatile unsigned char *)(PIOC_SFR_BASE+0x0A))) // RO/RW, IO port direction and mode
//#define  RB_PORT_MOD3       0x80                      // RO/RW, IO port mode 3
//#define  RB_PORT_MOD2       0x40                      // RO/RW, IO port mode 2
//#define  RB_PORT_MOD1       0x20                      // RO/RW, IO port mode 1
//#define  RB_PORT_MOD0       0x10                      // RO/RW, IO port mode 0
//#define  RB_PORT_PU1        0x08                      // RO/RW, IO1 port pullup enable
//#define  RB_PORT_PU0        0x04                      // RO/RW, IO0 port pullup enable
#define  RB_PORT_DIR1       0x02                      // RO/RW, IO1 port direction
#define  RB_PORT_DIR0       0x01                      // RO/RW, IO0 port direction

