kholia/hal_wch/ch32fun/ch32h41xhw.h
/* SAI_Block_Flags_Definition */
#define SAI_FLAG_OVRUDR                 ((uint32_t)SAI_SR_OVRUDR)
#define SAI_FLAG_MUTEDET                ((uint32_t)SAI_SR_MUTEDET)
#define SAI_FLAG_WCKCFG                 ((uint32_t)SAI_SR_WCKCFG)
#define SAI_FLAG_FREQ                   ((uint32_t)SAI_SR_FREQ)
#define SAI_FLAG_CNRDY                  ((uint32_t)SAI_SR_CNRDY)
#define SAI_FLAG_AFSDET                 ((uint32_t)SAI_SR_AFSDET)
#define SAI_FLAG_LFSDET                 ((uint32_t)SAI_SR_LFSDET)

/* SAI_Block_Fifo_Status_Level */
#define SAI_FIFOStatus_Empty            ((uint32_t)0x00000000)
#define SAI_FIFOStatus_Less1QuarterFull ((uint32_t)0x00010000)
#define SAI_FIFOStatus_1QuarterFull     ((uint32_t)0x00020000)
#define SAI_FIFOStatus_HalfFull         ((uint32_t)0x00030000)
#define SAI_FIFOStatus_3QuartersFull    ((uint32_t)0x00040000)
#define SAI_FIFOStatus_Full             ((uint32_t)0x00050000)

/* ch32h417_sdmmc.h -----------------------------------------------------------*/

/* SDMMC_Mode */
#define SDMMC_Mode_Host                             ((uint16_t)0x00000000)
#define SDMMC_Mode_Slave                            ((uint16_t)SDMMC_SLV_MODE)

/* SDMMC_PhaseInv */
#define SDMMC_Phase_No_Inverse                      ((uint16_t)0x00000000)
#define SDMMC_Phase_Inverse                         ((uint16_t)SDMMC_PHASEINV)

/* SDMMC_ClockSpeed */
#define SDMMC_ClockSpeed_Low                        ((uint16_t)0x00000000)
#define SDMMC_ClockSpeed_High                       ((uint16_t)(SDMMC_CLKMode))

/* SDMMC_BusWidth */
#define SDMMC_BusWidth_1                            ((uint32_t)0x00000000)
#define SDMMC_BusWidth_4                            ((uint32_t)0x00000001)
#define SDMMC_BusWidth_8                            ((uint32_t)0x00000002)

/* SDMMC_ClockEdge */
#define SDMMC_SampleClock_Rising                    ((uint8_t)0x00000000)
#define SDMMC_SampleClock_Falling                   ((uint8_t)SDMMC_NEGSMP)

/* SDMMC_RespExpect */
#define SDMMC_Resp_NONE                             ((uint16_t)0x0000)
#define SDMMC_Resp_136                              ((uint16_t)0x00100)
#define SDMMC_Resp_48                               ((uint16_t)0x00200)
#define SDMMC_Resp_R1b                              ((uint16_t)0x00300)

/* TranMode_Direction */
#define SDMMC_TranDir_Receive                       ((uint32_t)0x00000000)
#define SDMMC_TranDir_Send                          ((uint32_t)SDMMC_DMA_DIR)

/* DDR_ClockSW_Mode */
#define SDMMC_DDR_ClockSW_Mode_In                   ((uint32_t)0x00000000)
#define SDMMC_DDR_ClockSW_Mode_Auto                 ((uint32_t)0x00080000)
#define SDMMC_DDR_ClockSW_Mode_Force                ((uint32_t)0x00100000)

/* SDMMC_Flags */
#define SDMMC_FLAG_SLV_BUF_RELEASE                  ((uint16_t)0x0400)
#define SDMMC_FLAG_SDIOINT                          ((uint16_t)0x0200)
#define SDMMC_FLAG_FIFO_OV                          ((uint16_t)0x0100)
#define SDMMC_FLAG_BKGAP                            ((uint16_t)0x0080)
#define SDMMC_FLAG_TRANDONE                         ((uint16_t)0x0040)
#define SDMMC_FLAG_TRANERR                          ((uint16_t)0x0020)
#define SDMMC_FLAG_DATTMO                           ((uint16_t)0x0010)
#define SDMMC_FLAG_CMDDONE                          ((uint16_t)0x0008)
#define SDMMC_FLAG_REIDX_ER                         ((uint16_t)0x0004)
#define SDMMC_FLAG_RECRC_WR                         ((uint16_t)0x0002)
#define SDMMC_FLAG_RE_TMOUT                         ((uint16_t)0x0001)

/* SDMMC_Interrupt_Sources */
#define SDMMC_IT_SDIOINT                            ((uint16_t)0x0200)
#define SDMMC_IT_FIFO_OV                            ((uint16_t)0x0100)
#define SDMMC_IT_BKGAP                              ((uint16_t)0x0080)
#define SDMMC_IT_TRANDONE                           ((uint16_t)0x0040)
#define SDMMC_IT_TRANERR                            ((uint16_t)0x0020)
#define SDMMC_IT_DATTMO                             ((uint16_t)0x0010)
#define SDMMC_IT_CMDDONE                            ((uint16_t)0x0008)
#define SDMMC_IT_REIDX_ER                           ((uint16_t)0x0004)
#define SDMMC_IT_RECRC_WR                           ((uint16_t)0x0002)
#define SDMMC_IT_RE_TMOUT                           ((uint16_t)0x0001)

/* ch32h417_swpmi.h -----------------------------------------------------------*/

/* Tx_Buffering_Mode */
#define SWPMI_TxMode_Buffering_None                 ((uint32_t)0x0)
#define SWPMI_TxMode_Buffering_Single               ((uint32_t)0x2)
#define SWPMI_TxMode_Buffering_Multi                ((uint32_t)0xA)

/* Rx_Buffering_Mode */
#define SWPMI_RxMode_Buffering_None                 ((uint32_t)0x0)
#define SWPMI_RxMode_Buffering_Single               ((uint32_t)0x1)
#define SWPMI_RxMode_Buffering_Multi                ((uint32_t)0x5)

/* SWPMI interrupts definition */
#define SWPMI_IT_RXBF                               ((uint16_t)0x0001)
#define SWPMI_IT_TXBE                               ((uint16_t)0x0002)
#define SWPMI_IT_RXBER                              ((uint16_t)0x0004)
#define SWPMI_IT_RXOVR                              ((uint16_t)0x0008)
#define SWPMI_IT_TXUNR                              ((uint16_t)0x0010)
#define SWPMI_IT_RXNE                               ((uint16_t)0x0020)
#define SWPMI_IT_TXE                                ((uint16_t)0x0040)
#define SWPMI_IT_TC                                 ((uint16_t)0x0080)
#define SWPMI_IT_SR                                 ((uint16_t)0x0100)
#define SWPMI_IT_RDY                                ((uint16_t)0x0800)

/* SWPMI flags definition */
#define SWPMI_FLAG_RXBF                             ((uint16_t)0x0001)
#define SWPMI_FLAG_TXBE                             ((uint16_t)0x0002)
#define SWPMI_FLAG_RXBER                            ((uint16_t)0x0004)
#define SWPMI_FLAG_RXOVR                            ((uint16_t)0x0008)
#define SWPMI_FLAG_TXUNR                            ((uint16_t)0x0010)
#define SWPMI_FLAG_RXNE                             ((uint16_t)0x0020)
#define SWPMI_FLAG_TXE                              ((uint16_t)0x0040)
#define SWPMI_FLAG_TC                               ((uint16_t)0x0080)
#define SWPMI_FLAG_SR                               ((uint16_t)0x0100)
#define SWPMI_FLAG_SUSP                             ((uint16_t)0x0200)
#define SWPMI_FLAG_DEACT                            ((uint16_t)0x0400)
#define SWPMI_FLAG_RDY                              ((uint16_t)0x0800)

/* ch32h417_usbpd.h -----------------------------------------------------------*/

/* Register Bit Definition */
/* USBPD->CONFIG */
#define PD_FILT_ED          (1<<0)             /* PD pin input filter enable */
#define PD_ALL_CLR          (1<<1)             /* Clear all interrupt flags */
#define CC_SEL              (1<<2)             /* Select PD communication port */
#define PD_DMA_EN           (1<<3)             /* Enable DMA for USBPD */
#define PD_RST_EN           (1<<4)             /* PD mode reset command enable */
#define WAKE_POLAR          (1<<5)             /* PD port wake-up level */
#define IE_PD_IO            (1<<10)            /* PD IO interrupt enable */
#define IE_RX_BIT           (1<<11)            /* Receive bit interrupt enable */
#define IE_RX_BYTE          (1<<12)            /* Receive byte interrupt enable */
#define IE_RX_ACT           (1<<13)            /* Receive completion interrupt enable */
#define IE_RX_RESET         (1<<14)            /* Reset interrupt enable */
#define IE_TX_END           (1<<15)            /* Transfer completion interrupt enable */

/* USBPD->CONTROL */
#define PD_TX_EN            (1<<0)             /* USBPD transceiver mode and transmit enable */
#define BMC_START           (1<<1)             /* BMC send start signal */
#define RX_STATE_0          (1<<2)             /* PD received state bit 0 */
#define RX_STATE_1          (1<<3)             /* PD received state bit 1 */
#define RX_STATE_2          (1<<4)             /* PD received state bit 2 */
#define DATA_FLAG           (1<<5)             /* Cache data valid flag bit */
#define TX_BIT_BACK         (1<<6)             /* Indicates the current bit status of the BMC when sending the code */
#define BMC_BYTE_HI         (1<<7)             /* Indicates the current half-byte status of the PD data being sent and received */

/* USBPD->TX_SEL */
#define TX_SEL1             (0<<0)
#define TX_SEL1_SYNC1       (0<<0)             /* 0-SYNC1 */
#define TX_SEL1_RST1        (1<<0)             /* 1-RST1 */
#define TX_SEL2_Mask        (3<<2)
#define TX_SEL2_SYNC1       (0<<2)             /* 00-SYNC1 */
#define TX_SEL2_SYNC3       (1<<2)             /* 01-SYNC3 */
#define TX_SEL2_RST1        (2<<2)             /* 1x-RST1 */
#define TX_SEL3_Mask        (3<<4)
#define TX_SEL3_SYNC1       (0<<4)             /* 00-SYNC1 */
#define TX_SEL3_SYNC3       (1<<4)             /* 01-SYNC3 */
#define TX_SEL3_RST1        (2<<4)             /* 1x-RST1 */
#define TX_SEL4_Mask        (3<<6)
#define TX_SEL4_SYNC2       (0<<6)             /* 00-SYNC2 */
#define TX_SEL4_SYNC3       (1<<6)             /* 01-SYNC3 */
#define TX_SEL4_RST2        (2<<6)             /* 1x-RST2 */

/* USBPD->STATUS */
#define BMC_AUX_Mask        (3<<0)              /* Clear BMC auxiliary information */
#define BMC_AUX_INVALID     (0<<0)              /* 00-Invalid */
#define BMC_AUX_SOP0        (1<<0)              /* 01-SOP0 */
#define BMC_AUX_SOP1_HRST   (2<<0)              /* 10-SOP1 hard reset */
#define BMC_AUX_SOP2_CRST   (3<<0)              /* 11-SOP2 cable reset */
#define BUF_ERR             (1<<2)              /* BUFFER or DMA error interrupt flag */
#define IF_RX_BIT           (1<<3)              /* Receive bit or 5bit interrupt flag */
#define IF_RX_BYTE          (1<<4)              /* Receive byte or SOP interrupt flag */
#define IF_RX_ACT           (1<<5)              /* Receive completion interrupt flag */
#define IF_RX_RESET         (1<<6)              /* Receive reset interrupt flag */
#define IF_TX_END           (1<<7)              /* Transfer completion interrupt flag */

/* USBPD->PORT_CC1 */
/* USBPD->PORT_CC2 */
#define PA_CC_AI            (1<<0)               /* CC port comparator analogue input */
#define CC_PD               (1<<1)               /* CC port pull-down resistor enable */
#define CC_PU_Mask          (3<<2)               /* Clear CC port pull-up current */
#define CC_NO_PU            (0<<2)               /* 00-Prohibit pull-up current */
#define CC_PU_330           (1<<2)               /* 01-330uA */
#define CC_PU_180           (2<<2)               /* 10-180uA */
#define CC_PU_80            (3<<2)               /* 11-80uA */
#define CC_LVE              (1<<4)               /* CC port output low voltage enable */
#define CC_CMP_Mask         (7<<5)               /* Clear CC_CMP*/
#define CC_NO_CMP           (0<<5)               /* 000-closed */
#define CC_CMP_22           (2<<5)               /* 010-0.22V */
#define CC_CMP_45           (3<<5)               /* 011-0.45V */
#define CC_CMP_55           (4<<5)               /* 100-0.55V */
#define CC_CMP_66           (5<<5)               /* 101-0.66V */
#define CC_CMP_95           (6<<5)               /* 110-0.95V */
#define CC_CMP_123          (7<<5)               /* 111-1.23V */
#define USBPD_IN_HVT        (1<<9)
/*********************************************************
 * PD pin PC14/PC15 high threshold input mode:
 * 1-High threshold input (2.2V typical), to reduce the I/O power consumption during PD communication
 * 0-Normal GPIO threshold input
 * *******************************************************/
#define USBPD_PHY_V33       (1<<8)
/**********************************************************
* PD transceiver PHY pull-up limit configuration bits:
* 1-Direct use of VDD for GPIO applications or PD applications with VDD voltage of 3.3V
* 0-LDO buck enabled, limited to approx 3.3V, for PD applications with VDD more than 4V
* ********************************************************/

/* Control Message Types */
#define DEF_TYPE_RESERVED          0x00
#define DEF_TYPE_GOODCRC           0x01                                         /* Send By: Source,Sink,Cable Plug */
#define DEF_TYPE_GOTOMIN           0x02                                         /* Send By: Source */
#define DEF_TYPE_ACCEPT            0x03                                         /* Send By: Source,Sink,Cable Plug */
#define DEF_TYPE_REJECT            0x04                                         /* Send By: Source,Sink,Cable Plug */
#define DEF_TYPE_PING              0x05                                         /* Send By: Source */
#define DEF_TYPE_PS_RDY            0x06                                         /* Send By: Source,Sink */
#define DEF_TYPE_GET_SRC_CAP       0x07                                         /* Send By: Sink,DRP */
#define DEF_TYPE_GET_SNK_CAP       0x08                                         /* Send By: Source,DRP */
#define DEF_TYPE_DR_SWAP           0x09                                         /* Send By: Source,Sink */
#define DEF_TYPE_PR_SWAP           0x0A                                         /* Send By: Source,Sink */
#define DEF_TYPE_VCONN_SWAP        0x0B                                         /* Send By: Source,Sink */
#define DEF_TYPE_WAIT              0x0C                                         /* Send By: Source,Sink */
#define DEF_TYPE_SOFT_RESET        0x0D                                         /* Send By: Source,Sink */
#define DEF_TYPE_DATA_RESET        0x0E                                         /* Send By: Source,Sink */
#define DEF_TYPE_DATA_RESET_CMP    0x0F                                         /* Send By: Source,Sink */
#define DEF_TYPE_NOT_SUPPORT       0x10                                         /* Send By: Source,Sink,Cable Plug */
#define DEF_TYPE_GET_SRC_CAP_EX    0x11                                         /* Send By: Sink,DRP */
#define DEF_TYPE_GET_STATUS        0x12                                         /* Send By: Source,Sink */
#define DEF_TYPE_GET_STATUS_R      0X02                                         /* ext=1 */
#define DEF_TYPE_FR_SWAP           0x13                                         /* Send By: Sink */
#define DEF_TYPE_GET_PPS_STATUS    0x14                                         /* Send By: Sink */
#define DEF_TYPE_GET_CTY_CODES     0x15                                         /* Send By: Source,Sink */
#define DEF_TYPE_GET_SNK_CAP_EX    0x16                                         /* Send By: Source,DRP */
#define DEF_TYPE_GET_SRC_INFO      0x17                                         /* Send By: Sink,DRP */
#define DEF_TYPE_GET_REVISION      0x18                                         /* Send By: Source,Sink */

/* Data Message Types */
#define DEF_TYPE_SRC_CAP           0x01                                         /* Send By: Source,Dual-Role Power */
#define DEF_TYPE_REQUEST           0x02                                         /* Send By: Sink */
#define DEF_TYPE_BIST              0x03                                         /* Send By: Tester,Source,Sink */
#define DEF_TYPE_SNK_CAP           0x04                                         /* Send By: Sink,Dual-Role Power */
#define DEF_TYPE_BAT_STATUS        0x05                                         /* Send By: Source,Sink */
#define DEF_TYPE_ALERT             0x06                                         /* Send By: Source,Sink */
#define DEF_TYPE_GET_CTY_INFO      0x07                                         /* Send By: Source,Sink */
#define DEF_TYPE_ENTER_USB         0x08                                         /* Send By: DFP */
#define DEF_TYPE_EPR_REQUEST       0x09                                         /* Send By: Sink */
#define DEF_TYPE_EPR_MODE          0x0A                                         /* Send By: Source,Sink */
#define DEF_TYPE_SRC_INFO          0x0B                                         /* Send By: Source */
#define DEF_TYPE_REVISION          0x0C                                         /* Send By: Source,Sink,Cable Plug */
#define DEF_TYPE_VENDOR_DEFINED    0x0F                                         /* Send By: Source,Sink,Cable Plug */

