kholia/hal_wch/ch32fun/ch32h41xhw.h
/* Vendor Define Message Command */
#define DEF_VDM_DISC_IDENT         0x01
#define DEF_VDM_DISC_SVID          0x02
#define DEF_VDM_DISC_MODE          0x03
#define DEF_VDM_ENTER_MODE         0x04
#define DEF_VDM_EXIT_MODE          0x05
#define DEF_VDM_ATTENTION          0x06
#define DEF_VDM_DP_S_UPDATE        0x10
#define DEF_VDM_DP_CONFIG          0x11

/* PD Revision */
#define DEF_PD_REVISION_10         0x00
#define DEF_PD_REVISION_20         0x01
#define DEF_PD_REVISION_30         0x02


/* PD PHY Channel */
#define DEF_PD_CC1                 0x00
#define DEF_PD_CC2                 0x01

#define PIN_CC1                    GPIO_Pin_3
#define PIN_CC2                    GPIO_Pin_4

/* PD Tx Status */
#define DEF_PD_TX_OK               0x00
#define DEF_PD_TX_FAIL             0x01

/* PDO INDEX */
#define PDO_INDEX_1                1
#define PDO_INDEX_2                2
#define PDO_INDEX_3                3
#define PDO_INDEX_4                4
#define PDO_INDEX_5                5

/******************************************************************************/
#define UPD_TMR_TX_120M   (200-1)                                             /* timer value for USB PD BMC transmittal @Fsys=120MHz */
#define UPD_TMR_RX_120M   (300-1)                                            /* timer value for USB PD BMC receiving @Fsys=120MHz */
#define UPD_TMR_TX_96M    (160-1)                                             /* timer value for USB PD BMC transmittal @Fsys=96MHz */
#define UPD_TMR_RX_96M    (240-1)                                            /* timer value for USB PD BMC receiving @Fsys=96MHz */
#define UPD_TMR_TX_48M    (80-1)                                             /* timer value for USB PD BMC transmittal @Fsys=48MHz */
#define UPD_TMR_RX_48M    (120-1)                                            /* timer value for USB PD BMC receiving @Fsys=48MHz */
#define UPD_TMR_TX_24M    (40-1)                                             /* timer value for USB PD BMC transmittal @Fsys=24MHz */
#define UPD_TMR_RX_24M    (60-1)                                             /* timer value for USB PD BMC receiving @Fsys=24MHz */
#define UPD_TMR_TX_12M    (20-1)                                             /* timer value for USB PD BMC transmittal @Fsys=12MHz */
#define UPD_TMR_RX_12M    (30-1)                                             /* timer value for USB PD BMC receiving @Fsys=12MHz */

#define MASK_PD_STAT      0x03                                               /* Bit mask for current PD status */
#define PD_RX_SOP0        0x01                                               /* SOP0 received */
#define PD_RX_SOP1_HRST   0x02                                               /* SOP1 or Hard Reset received */
#define PD_RX_SOP2_CRST   0x03                                               /* SOP2 or Cable Reset received */

#define UPD_SOP0          ( TX_SEL1_SYNC1 | TX_SEL2_SYNC1 | TX_SEL3_SYNC1 | TX_SEL4_SYNC2 )     /* SOP1 */
#define UPD_SOP1          ( TX_SEL1_SYNC1 | TX_SEL2_SYNC1 | TX_SEL3_SYNC3 | TX_SEL4_SYNC3 )     /* SOP2 */
#define UPD_SOP2          ( TX_SEL1_SYNC1 | TX_SEL2_SYNC3 | TX_SEL3_SYNC1 | TX_SEL4_SYNC3 )     /* SOP3 */
#define UPD_HARD_RESET    ( TX_SEL1_RST1  | TX_SEL2_RST1  | TX_SEL3_RST1  | TX_SEL4_RST2  )     /* Hard Reset*/
#define UPD_CABLE_RESET   ( TX_SEL1_RST1  | TX_SEL2_SYNC1 | TX_SEL3_RST1  | TX_SEL4_SYNC3 )     /* Cable Reset*/

/* ch32h417_hsem.c -----------------------------------------------------------*/

/* HSEM Key */
#define HSEM_KEY   (0x5AA50000)

#ifdef __cplusplus
};
#endif


// For debug writing to the debug interface.
#define DMDATA0 ((volatile uint32_t*)0xe0000340)
#define DMDATA1 ((volatile uint32_t*)0xe0000344)
#define DMSTATUS_SENTINEL ((volatile uint32_t*)0xe0000348)// Reads as 0x00000000 if debugger is attached.

// Determination of PLL multiplication factor for non-V003 chips
#if !defined(FUNCONF_SYSTEM_CORE_CLOCK)
	#define PLL_MULTIPLICATION ((uint32_t)0)
#elif defined(FUNCONF_USE_PLL) && FUNCONF_USE_PLL
	#if FUNCONF_PLL_MULTIPLIER == 4
		#define PLL_MULTIPLICATION RCC_PLLMUL4
	#elif FUNCONF_PLL_MULTIPLIER == 6
		#define PLL_MULTIPLICATION RCC_PLLMUL6
	#elif FUNCONF_PLL_MULTIPLIER == 7
		#define PLL_MULTIPLICATION RCC_PLLMUL7
	#elif FUNCONF_PLL_MULTIPLIER == 8
		#define PLL_MULTIPLICATION RCC_PLLMUL8
	#elif FUNCONF_PLL_MULTIPLIER == 9
		#define PLL_MULTIPLICATION RCC_PLLMUL9
	#elif FUNCONF_PLL_MULTIPLIER == 10
		#define PLL_MULTIPLICATION RCC_PLLMUL10
	#elif FUNCONF_PLL_MULTIPLIER == 11
		#define PLL_MULTIPLICATION RCC_PLLMUL11
	#elif FUNCONF_PLL_MULTIPLIER == 12
		#define PLL_MULTIPLICATION RCC_PLLMUL12
	#elif FUNCONF_PLL_MULTIPLIER == 13
		#define PLL_MULTIPLICATION RCC_PLLMUL13
	#elif FUNCONF_PLL_MULTIPLIER == 14
		#define PLL_MULTIPLICATION RCC_PLLMUL14
	#elif FUNCONF_PLL_MULTIPLIER == 15
		#define PLL_MULTIPLICATION RCC_PLLMUL15
	#elif FUNCONF_PLL_MULTIPLIER == 16
		#define PLL_MULTIPLICATION RCC_PLLMUL16
	#elif FUNCONF_PLL_MULTIPLIER == 17
		#define PLL_MULTIPLICATION RCC_PLLMUL17
	#elif FUNCONF_PLL_MULTIPLIER == 18
		#define PLL_MULTIPLICATION RCC_PLLMUL18
	#elif FUNCONF_PLL_MULTIPLIER == 19
		#define PLL_MULTIPLICATION RCC_PLLMUL19
	#elif FUNCONF_PLL_MULTIPLIER == 20
		#define PLL_MULTIPLICATION RCC_PLLMUL20
	#elif FUNCONF_PLL_MULTIPLIER == 22
		#define PLL_MULTIPLICATION RCC_PLLMUL22
	#elif FUNCONF_PLL_MULTIPLIER == 24
		#define PLL_MULTIPLICATION RCC_PLLMUL24
	#elif FUNCONF_PLL_MULTIPLIER == 26
		#define PLL_MULTIPLICATION RCC_PLLMUL26
	#elif FUNCONF_PLL_MULTIPLIER == 28
		#define PLL_MULTIPLICATION RCC_PLLMUL28
	#elif FUNCONF_PLL_MULTIPLIER == 30
		#define PLL_MULTIPLICATION RCC_PLLMUL30
	#elif FUNCONF_PLL_MULTIPLIER == 32
		#define PLL_MULTIPLICATION RCC_PLLMUL32
	#elif FUNCONF_PLL_MULTIPLIER == 34
		#define PLL_MULTIPLICATION RCC_PLLMUL34
	#elif FUNCONF_PLL_MULTIPLIER == 36
		#define PLL_MULTIPLICATION RCC_PLLMUL36
	#elif FUNCONF_PLL_MULTIPLIER == 38
		#define PLL_MULTIPLICATION RCC_PLLMUL38
	#elif FUNCONF_PLL_MULTIPLIER == 40
		#define PLL_MULTIPLICATION RCC_PLLMUL40
	#elif FUNCONF_PLL_MULTIPLIER == 59
		#define PLL_MULTIPLICATION RCC_PLLMUL59
	#else
		#error "Invalid PLL multiplier"
	#endif
#endif



/* some bit definitions for systick regs */
#define SYSTICK_SR_CNTIF_V3F (1<<0)
#define SYSTICK_SR_SWIE (1<<31)
#define SYSTICK_SR_CNTIF_V5F (1<<1)
#define SYSTICK_CTLR_STE (1<<0)
#define SYSTICK_CTLR_STIE (1<<1)
#define SYSTICK_CTLR_STCLK (1<<2)
#define SYSTICK_CTLR_STRE (1<<3)

#define PFIC            ((PFIC_Type *) PFIC_BASE )
#define NVIC            PFIC
#define	NVIC_KEY3		((uint32_t)0xBEEF0080)


#define SysTick         ((SysTick_Type *) SysTick_BASE)

